import React from 'react'
import ReactDOM from 'react-dom/client'
import App from './App.jsx'
import './index.css'
import { doc, setDoc } from 'firebase/firestore'
import { firebaseDB } from './utils/firebaseInit.js'
import { supabase } from './supabase/initializing.js'

ReactDOM.createRoot(document.getElementById('root')).render(
  // <React.StrictMode>
  <App />
  // {/* </React.StrictMode>, */ }
)

document.documentElement.setAttribute('data-bs-theme', localStorage.getItem('theme') || 'light');

// const data = [
//   {
//     "name": "منةالله هشام دسوقى أحمد نور الدين",
//     "id": 20161,
//     "degrees": [
//       "74",
//       "90",
//       "98",
//       "96",
//       "100",
//       "88",
//       "100"
//     ],
//     "total_grade": "",
//     "total": 572,
//     "rank": 1,
//     "total_percentage": "95.33"
//   },
//   {
//     "name": "شيماء سعيد أحمد عبدالشافى",
//     "id": 20094,
//     "degrees": [
//       "90",
//       "90",
//       "97",
//       "100",
//       "95",
//       "96",
//       "92"
//     ],
//     "total_grade": "",
//     "total": 570,
//     "rank": 2,
//     "total_percentage": "95.00"
//   },
//   {
//     "name": "حبيبة هشام حنفى عبدالوهاب",
//     "id": 20044,
//     "degrees": [
//       "88",
//       "93",
//       "96",
//       "100",
//       "92",
//       "84",
//       "98"
//     ],
//     "total_grade": "",
//     "total": 563,
//     "rank": 3,
//     "total_percentage": "93.83"
//   },
//   {
//     "name": "شهد صلاح الدين على عبدالباقى",
//     "id": 20091,
//     "degrees": [
//       "86",
//       "72",
//       "98",
//       "100",
//       "94",
//       "94",
//       "100"
//     ],
//     "total_grade": "",
//     "total": 558,
//     "rank": 4,
//     "total_percentage": "93.00"
//   },
//   {
//     "name": "إسلام عزالدين محمد مهدى أحمد",
//     "id": 25011,
//     "degrees": [
//       "86",
//       "92",
//       "100",
//       "100",
//       "94",
//       "72",
//       "100"
//     ],
//     "total_grade": "",
//     "total": 558,
//     "rank": 5,
//     "total_percentage": "93.00"
//   },
//   {
//     "name": "ملك محمود عادل على محمود",
//     "id": 20156,
//     "degrees": [
//       "88",
//       "80",
//       "98",
//       "94",
//       "97",
//       "92",
//       "94"
//     ],
//     "total_grade": "",
//     "total": 555,
//     "rank": 6,
//     "total_percentage": "92.50"
//   },
//   {
//     "name": "وليد السيد حسني حنفي محمد",
//     "id": 20186,
//     "degrees": [
//       "92",
//       "88",
//       "96",
//       "100",
//       "95",
//       "83",
//       "92"
//     ],
//     "total_grade": "",
//     "total": 554,
//     "rank": 7,
//     "total_percentage": "92.33"
//   },
//   {
//     "name": "حبيبة أحمد جابر محمد",
//     "id": 20042,
//     "degrees": [
//       "82",
//       "87",
//       "94",
//       "95",
//       "95",
//       "86",
//       "96"
//     ],
//     "total_grade": "",
//     "total": 553,
//     "rank": 8,
//     "total_percentage": "92.17"
//   },
//   {
//     "name": "آلاء أحمد محمد السيد متولي",
//     "id": 20001,
//     "degrees": [
//       "82",
//       "75",
//       "98",
//       "99",
//       "89",
//       "89",
//       "100"
//     ],
//     "total_grade": "",
//     "total": 550,
//     "rank": 9,
//     "total_percentage": "91.67"
//   },
//   {
//     "name": "أروي جمال عبدالمعبود جمال عبدالمعبود أحمد الفقي",
//     "id": 20017,
//     "degrees": [
//       "90",
//       "86",
//       "94",
//       "96",
//       "91",
//       "82",
//       "100"
//     ],
//     "total_grade": "",
//     "total": 549,
//     "rank": 10,
//     "total_percentage": "91.50"
//   },
//   {
//     "name": "إسراء إبراهيم صبحى النياد",
//     "id": 20018,
//     "degrees": [
//       "94",
//       "88",
//       "94",
//       "94",
//       "91",
//       "83",
//       "98"
//     ],
//     "total_grade": "",
//     "total": 548,
//     "rank": 11,
//     "total_percentage": "91.33"
//   },
//   {
//     "name": "سامية حسام حفني خلف",
//     "id": 20078,
//     "degrees": [
//       "88",
//       "91",
//       "94",
//       "96",
//       "92",
//       "78",
//       "97"
//     ],
//     "total_grade": "",
//     "total": 548,
//     "rank": 12,
//     "total_percentage": "91.33"
//   },
//   {
//     "name": "شهد حسن عبدالفضيل مصطفى",
//     "id": 20435,
//     "degrees": [
//       "82",
//       "84",
//       "93",
//       "89",
//       "93",
//       "91",
//       "98"
//     ],
//     "total_grade": "",
//     "total": 548,
//     "rank": 13,
//     "total_percentage": "91.33"
//   },
//   {
//     "name": "سندس أحمد شوقى فرغلى إسماعيل",
//     "id": 20085,
//     "degrees": [
//       "84",
//       "83",
//       "96",
//       "100",
//       "92",
//       "82",
//       "94"
//     ],
//     "total_grade": "",
//     "total": 547,
//     "rank": 14,
//     "total_percentage": "91.17"
//   },
//   {
//     "name": "رحمة أحمد فتح الباب فهمي",
//     "id": 20058,
//     "degrees": [
//       "94",
//       "76",
//       "95",
//       "100",
//       "97",
//       "88",
//       "90"
//     ],
//     "total_grade": "",
//     "total": 546,
//     "rank": 15,
//     "total_percentage": "91.00"
//   },
//   {
//     "name": "عمر محمد سعيد محمد بدوى",
//     "id": 20111,
//     "degrees": [
//       "86",
//       "85",
//       "97",
//       "100",
//       "89",
//       "81",
//       "92"
//     ],
//     "total_grade": "",
//     "total": 544,
//     "rank": 16,
//     "total_percentage": "90.67"
//   },
//   {
//     "name": "فاطمة سعودى سعيد عبدالتواب",
//     "id": 20114,
//     "degrees": [
//       "76",
//       "89",
//       "74",
//       "96",
//       "91",
//       "94",
//       "100"
//     ],
//     "total_grade": "",
//     "total": 544,
//     "rank": 17,
//     "total_percentage": "90.67"
//   },
//   {
//     "name": "مختار محمد توفيق الجندى",
//     "id": 20143,
//     "degrees": [
//       "82",
//       "86",
//       "98",
//       "95",
//       "84",
//       "85",
//       "95"
//     ],
//     "total_grade": "",
//     "total": 543,
//     "rank": 18,
//     "total_percentage": "90.50"
//   },
//   {
//     "name": "إيمان محمود قرشى حسنين حسن",
//     "id": 20031,
//     "degrees": [
//       "92",
//       "82",
//       "91",
//       "100",
//       "85",
//       "88",
//       "96"
//     ],
//     "total_grade": "",
//     "total": 542,
//     "rank": 19,
//     "total_percentage": "90.33"
//   },
//   {
//     "name": "عائشة نادر عبدالمجيد عبدالعزيز حسين",
//     "id": 20098,
//     "degrees": [
//       "82",
//       "82",
//       "94",
//       "95",
//       "82",
//       "90",
//       "99"
//     ],
//     "total_grade": "",
//     "total": 542,
//     "rank": 20,
//     "total_percentage": "90.33"
//   },
//   {
//     "name": "زهراء مصطفى طه عبدالجواد",
//     "id": 20071,
//     "degrees": [
//       "84",
//       "79",
//       "90",
//       "97",
//       "96",
//       "79",
//       "100"
//     ],
//     "total_grade": "",
//     "total": 541,
//     "rank": 21,
//     "total_percentage": "90.17"
//   },
//   {
//     "name": "عبدالرحمن طلعت محمد على",
//     "id": 20100,
//     "degrees": [
//       "80",
//       "89",
//       "90",
//       "95",
//       "84",
//       "88",
//       "95"
//     ],
//     "total_grade": "",
//     "total": 541,
//     "rank": 22,
//     "total_percentage": "90.17"
//   },
//   {
//     "name": "فاطمة محمد عمار محمد",
//     "id": 20116,
//     "degrees": [
//       "88",
//       "91",
//       "91",
//       "93",
//       "83",
//       "82",
//       "100"
//     ],
//     "total_grade": "",
//     "total": 540,
//     "rank": 23,
//     "total_percentage": "90.00"
//   },
//   {
//     "name": "آلاء عيد وداعه محمد على",
//     "id": 20004,
//     "degrees": [
//       "70",
//       "82",
//       "97",
//       "95",
//       "89",
//       "81",
//       "95"
//     ],
//     "total_grade": "",
//     "total": 539,
//     "rank": 24,
//     "total_percentage": "89.83"
//   },
//   {
//     "name": "رقية عاطف إبراهيم أبوالوفا",
//     "id": 20065,
//     "degrees": [
//       "94",
//       "81",
//       "95",
//       "100",
//       "87",
//       "81",
//       "92"
//     ],
//     "total_grade": "",
//     "total": 536,
//     "rank": 25,
//     "total_percentage": "89.33"
//   },
//   {
//     "name": "لجين أحمد زغلول عباس مهران",
//     "id": 20122,
//     "degrees": [
//       "82",
//       "88",
//       "86",
//       "93",
//       "85",
//       "87",
//       "97"
//     ],
//     "total_grade": "",
//     "total": 536,
//     "rank": 26,
//     "total_percentage": "89.33"
//   },
//   {
//     "name": "أسماء أحمد محمد عبدالصادق",
//     "id": 20022,
//     "degrees": [
//       "86",
//       "82",
//       "97",
//       "96",
//       "84",
//       "90",
//       "86"
//     ],
//     "total_grade": "",
//     "total": 535,
//     "rank": 27,
//     "total_percentage": "89.17"
//   },
//   {
//     "name": "إسراء سيد معوض حامد عبود",
//     "id": 20020,
//     "degrees": [
//       "88",
//       "90",
//       "98",
//       "95",
//       "79",
//       "85",
//       "87"
//     ],
//     "total_grade": "",
//     "total": 534,
//     "rank": 28,
//     "total_percentage": "89.00"
//   },
//   {
//     "name": "بلال مجدى عبدالله عبدالقادر عبدالله",
//     "id": 20035,
//     "degrees": [
//       "76",
//       "87",
//       "85",
//       "94",
//       "90",
//       "82",
//       "92"
//     ],
//     "total_grade": "",
//     "total": 530,
//     "rank": 29,
//     "total_percentage": "88.33"
//   },
//   {
//     "name": "باسل هاني محمد أبوبكر",
//     "id": 20032,
//     "degrees": [
//       "86",
//       "87",
//       "86",
//       "96",
//       "88",
//       "85",
//       "87"
//     ],
//     "total_grade": "",
//     "total": 529,
//     "rank": 30,
//     "total_percentage": "88.17"
//   },
//   {
//     "name": "آية أحمد محمود متولى",
//     "id": 20006,
//     "degrees": [
//       "82",
//       "89",
//       "87",
//       "98",
//       "90",
//       "80",
//       "83"
//     ],
//     "total_grade": "",
//     "total": 527,
//     "rank": 31,
//     "total_percentage": "87.83"
//   },
//   {
//     "name": "زينب إيهاب يوسف محمد الزاهى",
//     "id": 20074,
//     "degrees": [
//       "80",
//       "82",
//       "77",
//       "98",
//       "86",
//       "85",
//       "99"
//     ],
//     "total_grade": "",
//     "total": 527,
//     "rank": 32,
//     "total_percentage": "87.83"
//   },
//   {
//     "name": "شهد عوض يوسف عوض",
//     "id": 20092,
//     "degrees": [
//       "84",
//       "80",
//       "98",
//       "84",
//       "90",
//       "89",
//       "86"
//     ],
//     "total_grade": "",
//     "total": 527,
//     "rank": 33,
//     "total_percentage": "87.83"
//   },
//   {
//     "name": "سلمى طارق إبراهيم محمد",
//     "id": 20433,
//     "degrees": [
//       "78",
//       "64",
//       "90",
//       "98",
//       "93",
//       "86",
//       "96"
//     ],
//     "total_grade": "",
//     "total": 527,
//     "rank": 34,
//     "total_percentage": "87.83"
//   },
//   {
//     "name": "حامد طه حامد عطية عبدالمعطى الزيدى",
//     "id": 25024,
//     "degrees": [
//       "88",
//       "79",
//       "100",
//       "90",
//       "89",
//       "74",
//       "94"
//     ],
//     "total_grade": "",
//     "total": 526,
//     "rank": 35,
//     "total_percentage": "87.67"
//   },
//   {
//     "name": "عائشة نبيل جابر عبدالتواب",
//     "id": 20099,
//     "degrees": [
//       "64",
//       "83",
//       "81",
//       "97",
//       "87",
//       "88",
//       "88"
//     ],
//     "total_grade": "",
//     "total": 524,
//     "rank": 36,
//     "total_percentage": "87.33"
//   },
//   {
//     "name": "نسمة حمادة محمد عبدالحميد الربع",
//     "id": 20170,
//     "degrees": [
//       "64",
//       "80",
//       "93",
//       "97",
//       "93",
//       "76",
//       "85"
//     ],
//     "total_grade": "",
//     "total": 524,
//     "rank": 37,
//     "total_percentage": "87.33"
//   },
//   {
//     "name": "ياسمين محمد حسنى محمد عبدالحميد",
//     "id": 20188,
//     "degrees": [
//       "88",
//       "87",
//       "94",
//       "95",
//       "78",
//       "82",
//       "87"
//     ],
//     "total_grade": "",
//     "total": 523,
//     "rank": 38,
//     "total_percentage": "87.17"
//   },
//   {
//     "name": "أحمد عبدالجواد أحمد سلامة هيكل",
//     "id": 20012,
//     "degrees": [
//       "80",
//       "82",
//       "82",
//       "93",
//       "93",
//       "73",
//       "99"
//     ],
//     "total_grade": "",
//     "total": 522,
//     "rank": 39,
//     "total_percentage": "87.00"
//   },
//   {
//     "name": "هاجر منير عبدالله السيد رفاعي",
//     "id": 20176,
//     "degrees": [
//       "80",
//       "76",
//       "86",
//       "98",
//       "90",
//       "84",
//       "88"
//     ],
//     "total_grade": "",
//     "total": 522,
//     "rank": 40,
//     "total_percentage": "87.00"
//   },
//   {
//     "name": "منةالله مصطفى السيد الجارحى",
//     "id": 20446,
//     "degrees": [
//       "76",
//       "79",
//       "97",
//       "80",
//       "90",
//       "81",
//       "94"
//     ],
//     "total_grade": "",
//     "total": 521,
//     "rank": 41,
//     "total_percentage": "86.83"
//   },
//   {
//     "name": "آلاء ربيع عبدالواحد السيد",
//     "id": 20002,
//     "degrees": [
//       "70",
//       "92",
//       "90",
//       "100",
//       "82",
//       "72",
//       "82"
//     ],
//     "total_grade": "",
//     "total": 518,
//     "rank": 42,
//     "total_percentage": "86.33"
//   },
//   {
//     "name": "فاطمة فتحى حسين إبراهيم",
//     "id": 25058,
//     "degrees": [
//       "88",
//       "65",
//       "99",
//       "97",
//       "87",
//       "78",
//       "92"
//     ],
//     "total_grade": "",
//     "total": 518,
//     "rank": 43,
//     "total_percentage": "86.33"
//   },
//   {
//     "name": "محمد عبدالله رزق حسن مرسال",
//     "id": 20133,
//     "degrees": [
//       "86",
//       "78",
//       "77",
//       "85",
//       "89",
//       "84",
//       "99"
//     ],
//     "total_grade": "",
//     "total": 512,
//     "rank": 44,
//     "total_percentage": "85.33"
//   },
//   {
//     "name": "محمد سليمان",
//     "id": 20132,
//     "degrees": [
//       "92",
//       "62",
//       "97",
//       "91",
//       "87",
//       "82",
//       "91"
//     ],
//     "total_grade": "",
//     "total": 510,
//     "rank": 45,
//     "total_percentage": "85.00"
//   },
//   {
//     "name": "دينا مصطفى عبدالقادر مصطفى",
//     "id": 20054,
//     "degrees": [
//       "84",
//       "76",
//       "87",
//       "91",
//       "84",
//       "84",
//       "87"
//     ],
//     "total_grade": "",
//     "total": 509,
//     "rank": 46,
//     "total_percentage": "84.83"
//   },
//   {
//     "name": "زياد أحمد سمير عبدالعال",
//     "id": 20072,
//     "degrees": [
//       "74",
//       "83",
//       "89",
//       "91",
//       "84",
//       "69",
//       "92"
//     ],
//     "total_grade": "",
//     "total": 508,
//     "rank": 47,
//     "total_percentage": "84.67"
//   },
//   {
//     "name": "ليلي فرحان عبدالحميد عبدالله",
//     "id": 20124,
//     "degrees": [
//       "82",
//       "78",
//       "95",
//       "96",
//       "83",
//       "78",
//       "77"
//     ],
//     "total_grade": "",
//     "total": 507,
//     "rank": 48,
//     "total_percentage": "84.50"
//   },
//   {
//     "name": "آلاء عبدالناصر حسين عباس",
//     "id": 25001,
//     "degrees": [
//       "92",
//       "73",
//       "100",
//       "100",
//       "76",
//       "78",
//       "80"
//     ],
//     "total_grade": "",
//     "total": 507,
//     "rank": 49,
//     "total_percentage": "84.50"
//   },
//   {
//     "name": "عائشة محمود حسن سيد",
//     "id": 20097,
//     "degrees": [
//       "78",
//       "79",
//       "83",
//       "89",
//       "86",
//       "76",
//       "93"
//     ],
//     "total_grade": "",
//     "total": 506,
//     "rank": 50,
//     "total_percentage": "84.33"
//   },
//   {
//     "name": "عفاف رجب سيد إبراهيم حسن",
//     "id": 20107,
//     "degrees": [
//       "72",
//       "82",
//       "80",
//       "95",
//       "86",
//       "78",
//       "85"
//     ],
//     "total_grade": "",
//     "total": 506,
//     "rank": 51,
//     "total_percentage": "84.33"
//   },
//   {
//     "name": "شهد رضا محمد البندارى",
//     "id": 20090,
//     "degrees": [
//       "86",
//       "75",
//       "96",
//       "86",
//       "89",
//       "76",
//       "83"
//     ],
//     "total_grade": "",
//     "total": 505,
//     "rank": 52,
//     "total_percentage": "84.17"
//   },
//   {
//     "name": "منار عوض علي عبدربه",
//     "id": 20159,
//     "degrees": [
//       "84",
//       "78",
//       "91",
//       "93",
//       "80",
//       "81",
//       "82"
//     ],
//     "total_grade": "",
//     "total": 505,
//     "rank": 53,
//     "total_percentage": "84.17"
//   },
//   {
//     "name": "أسماء ضاحى على حسن",
//     "id": 20023,
//     "degrees": [
//       "72",
//       "76",
//       "85",
//       "87",
//       "89",
//       "77",
//       "89"
//     ],
//     "total_grade": "",
//     "total": 503,
//     "rank": 54,
//     "total_percentage": "83.83"
//   },
//   {
//     "name": "إيمان محمد عبدالغفار محمد إبراهيم",
//     "id": 20030,
//     "degrees": [
//       "84",
//       "78",
//       "85",
//       "96",
//       "77",
//       "83",
//       "84"
//     ],
//     "total_grade": "",
//     "total": 503,
//     "rank": 55,
//     "total_percentage": "83.83"
//   },
//   {
//     "name": "محمد محمود حسين أحمد",
//     "id": 20136,
//     "degrees": [
//       "68",
//       "81",
//       "82",
//       "95",
//       "78",
//       "82",
//       "85"
//     ],
//     "total_grade": "",
//     "total": 503,
//     "rank": 56,
//     "total_percentage": "83.83"
//   },
//   {
//     "name": "محمد خليل حسيني خليل طاحون",
//     "id": 20131,
//     "degrees": [
//       "64",
//       "80",
//       "73",
//       "94",
//       "82",
//       "77",
//       "92"
//     ],
//     "total_grade": "",
//     "total": 498,
//     "rank": 57,
//     "total_percentage": "83.00"
//   },
//   {
//     "name": "إسلام كامل جاد السيد",
//     "id": 25012,
//     "degrees": [
//       "76",
//       "82",
//       "96",
//       "87",
//       "89",
//       "70",
//       "74"
//     ],
//     "total_grade": "",
//     "total": 498,
//     "rank": 58,
//     "total_percentage": "83.00"
//   },
//   {
//     "name": "رؤى مجدى محمد عزت محمد",
//     "id": 20068,
//     "degrees": [
//       "86",
//       "73",
//       "88",
//       "91",
//       "75",
//       "86",
//       "84"
//     ],
//     "total_grade": "",
//     "total": 497,
//     "rank": 59,
//     "total_percentage": "82.83"
//   },
//   {
//     "name": "أسامة نجاح عبدالعظيم السيد جاد",
//     "id": 25007,
//     "degrees": [
//       "70",
//       "70",
//       "94",
//       "91",
//       "74",
//       "81",
//       "87"
//     ],
//     "total_grade": "",
//     "total": 497,
//     "rank": 60,
//     "total_percentage": "82.83"
//   },
//   {
//     "name": "يوسف عادل حامد عبدالمنعم مسعود",
//     "id": 25100,
//     "degrees": [
//       "78",
//       "78",
//       "99",
//       "94",
//       "80",
//       "71",
//       "75"
//     ],
//     "total_grade": "",
//     "total": 497,
//     "rank": 61,
//     "total_percentage": "82.83"
//   },
//   {
//     "name": "نسمة حسنى على أحمد",
//     "id": 20169,
//     "degrees": [
//       "80",
//       "74",
//       "100",
//       "78",
//       "79",
//       "76",
//       "87"
//     ],
//     "total_grade": "",
//     "total": 494,
//     "rank": 62,
//     "total_percentage": "82.33"
//   },
//   {
//     "name": "هاجر ناصر سيد إمبابي",
//     "id": 20177,
//     "degrees": [
//       "88",
//       "71",
//       "70",
//       "92",
//       "92",
//       "88",
//       "81"
//     ],
//     "total_grade": "",
//     "total": 494,
//     "rank": 63,
//     "total_percentage": "82.33"
//   },
//   {
//     "name": "على خالد عطية عواد الظفيرى",
//     "id": 20109,
//     "degrees": [
//       "84",
//       "77",
//       "83",
//       "100",
//       "94",
//       "69",
//       "70"
//     ],
//     "total_grade": "",
//     "total": 493,
//     "rank": 64,
//     "total_percentage": "82.17"
//   },
//   {
//     "name": "خالد جمال محمد بيومي أحمد",
//     "id": 20047,
//     "degrees": [
//       "86",
//       "78",
//       "76",
//       "96",
//       "70",
//       "82",
//       "90"
//     ],
//     "total_grade": "",
//     "total": 492,
//     "rank": 65,
//     "total_percentage": "82.00"
//   },
//   {
//     "name": "مريم رجب حسن محمد عويس",
//     "id": 20147,
//     "degrees": [
//       "82",
//       "72",
//       "92",
//       "89",
//       "81",
//       "79",
//       "79"
//     ],
//     "total_grade": "",
//     "total": 492,
//     "rank": 66,
//     "total_percentage": "82.00"
//   },
//   {
//     "name": "شهد خالد حسين عباس حسين",
//     "id": 20089,
//     "degrees": [
//       "78",
//       "71",
//       "83",
//       "85",
//       "92",
//       "84",
//       "76"
//     ],
//     "total_grade": "",
//     "total": 491,
//     "rank": 67,
//     "total_percentage": "81.83"
//   },
//   {
//     "name": "شيماء رمضان عبدالحليم عيسوي",
//     "id": 25051,
//     "degrees": [
//       "90",
//       "84",
//       "82",
//       "90",
//       "80",
//       "86",
//       "69"
//     ],
//     "total_grade": "",
//     "total": 491,
//     "rank": 68,
//     "total_percentage": "81.83"
//   },
//   {
//     "name": "رضوى سيد محمد مندى أحمد يوسف",
//     "id": 20062,
//     "degrees": [
//       "78",
//       "81",
//       "87",
//       "95",
//       "56",
//       "83",
//       "87"
//     ],
//     "total_grade": "",
//     "total": 489,
//     "rank": 69,
//     "total_percentage": "81.50"
//   },
//   {
//     "name": "مروة محمد عبدالتواب عبداللطيف",
//     "id": 25073,
//     "degrees": [
//       "80",
//       "78",
//       "81",
//       "91",
//       "72",
//       "74",
//       "93"
//     ],
//     "total_grade": "",
//     "total": 489,
//     "rank": 70,
//     "total_percentage": "81.50"
//   },
//   {
//     "name": "يوسف أحمد أبوبكر أحمد عبدالعال",
//     "id": 20191,
//     "degrees": [
//       "80",
//       "82",
//       "68",
//       "91",
//       "78",
//       "77",
//       "90"
//     ],
//     "total_grade": "",
//     "total": 486,
//     "rank": 71,
//     "total_percentage": "81.00"
//   },
//   {
//     "name": "ضحى أشرف السيد محمد علي",
//     "id": 25052,
//     "degrees": [
//       "80",
//       "74",
//       "86",
//       "96",
//       "77",
//       "80",
//       "73"
//     ],
//     "total_grade": "",
//     "total": 486,
//     "rank": 72,
//     "total_percentage": "81.00"
//   },
//   {
//     "name": "مريم أحمد عزازى محمد",
//     "id": 20145,
//     "degrees": [
//       "72",
//       "68",
//       "80",
//       "90",
//       "73",
//       "87",
//       "87"
//     ],
//     "total_grade": "",
//     "total": 485,
//     "rank": 73,
//     "total_percentage": "80.83"
//   },
//   {
//     "name": "وفاء شعبان إبراهيم سالم",
//     "id": 20184,
//     "degrees": [
//       "84",
//       "78",
//       "76",
//       "94",
//       "82",
//       "75",
//       "80"
//     ],
//     "total_grade": "",
//     "total": 485,
//     "rank": 74,
//     "total_percentage": "80.83"
//   },
//   {
//     "name": "وفاء طارق إبراهيم فضل",
//     "id": 25097,
//     "degrees": [
//       "84",
//       "68",
//       "88",
//       "95",
//       "71",
//       "90",
//       "73"
//     ],
//     "total_grade": "",
//     "total": 485,
//     "rank": 75,
//     "total_percentage": "80.83"
//   },
//   {
//     "name": "رنا إبراهيم أحمد صابر",
//     "id": 25035,
//     "degrees": [
//       "88",
//       "61",
//       "94",
//       "100",
//       "77",
//       "73",
//       "79"
//     ],
//     "total_grade": "",
//     "total": 484,
//     "rank": 76,
//     "total_percentage": "80.67"
//   },
//   {
//     "name": "مريم محمود حنفى محمود يوسف",
//     "id": 20152,
//     "degrees": [
//       "86",
//       "65",
//       "95",
//       "78",
//       "74",
//       "84",
//       "87"
//     ],
//     "total_grade": "",
//     "total": 483,
//     "rank": 77,
//     "total_percentage": "80.50"
//   },
//   {
//     "name": "مهاب عصام محمد شمس الدين زكى",
//     "id": 20163,
//     "degrees": [
//       "84",
//       "78",
//       "53",
//       "93",
//       "86",
//       "82",
//       "91"
//     ],
//     "total_grade": "",
//     "total": 483,
//     "rank": 78,
//     "total_percentage": "80.50"
//   },
//   {
//     "name": "ياسمين عبدالكريم علي رجب",
//     "id": 20187,
//     "degrees": [
//       "80",
//       "56",
//       "91",
//       "92",
//       "79",
//       "75",
//       "90"
//     ],
//     "total_grade": "",
//     "total": 483,
//     "rank": 79,
//     "total_percentage": "80.50"
//   },
//   {
//     "name": "آلاء سامر خالد فتحي",
//     "id": 20003,
//     "degrees": [
//       "76",
//       "71",
//       "85",
//       "87",
//       "78",
//       "72",
//       "88"
//     ],
//     "total_grade": "",
//     "total": 481,
//     "rank": 80,
//     "total_percentage": "80.17"
//   },
//   {
//     "name": "آية وليد سعد محمد إبراهيم",
//     "id": 20009,
//     "degrees": [
//       "66",
//       "72",
//       "95",
//       "96",
//       "81",
//       "58",
//       "79"
//     ],
//     "total_grade": "",
//     "total": 481,
//     "rank": 81,
//     "total_percentage": "80.17"
//   },
//   {
//     "name": "عبدالرضا فرج عبدالله فرج عبدالله فرج الخضرى",
//     "id": 20106,
//     "degrees": [
//       "74",
//       "78",
//       "77",
//       "90",
//       "81",
//       "77",
//       "78"
//     ],
//     "total_grade": "",
//     "total": 481,
//     "rank": 82,
//     "total_percentage": "80.17"
//   },
//   {
//     "name": "إسراء شوقي مهدي محمد",
//     "id": 20021,
//     "degrees": [
//       "70",
//       "65",
//       "89",
//       "67",
//       "80",
//       "90",
//       "87"
//     ],
//     "total_grade": "",
//     "total": 478,
//     "rank": 83,
//     "total_percentage": "79.67"
//   },
//   {
//     "name": "إسراء محمد صلاح رشاد",
//     "id": 20418,
//     "degrees": [
//       "78",
//       "67",
//       "88",
//       "94",
//       "70",
//       "79",
//       "80"
//     ],
//     "total_grade": "",
//     "total": 478,
//     "rank": 84,
//     "total_percentage": "79.67"
//   },
//   {
//     "name": "شهد جمعه محمد جمعه",
//     "id": 20434,
//     "degrees": [
//       "80",
//       "66",
//       "83",
//       "89",
//       "72",
//       "91",
//       "77"
//     ],
//     "total_grade": "",
//     "total": 478,
//     "rank": 85,
//     "total_percentage": "79.67"
//   },
//   {
//     "name": "سعيد محمد على أحمد رجب",
//     "id": 20080,
//     "degrees": [
//       "74",
//       "67",
//       "80",
//       "90",
//       "71",
//       "77",
//       "91"
//     ],
//     "total_grade": "",
//     "total": 476,
//     "rank": 86,
//     "total_percentage": "79.33"
//   },
//   {
//     "name": "أمانى سعيد عبدالهادى شحاتة",
//     "id": 20420,
//     "degrees": [
//       "78",
//       "71",
//       "82",
//       "83",
//       "84",
//       "70",
//       "86"
//     ],
//     "total_grade": "",
//     "total": 476,
//     "rank": 87,
//     "total_percentage": "79.33"
//   },
//   {
//     "name": "سهيلة محمد سعد صادق",
//     "id": 25043,
//     "degrees": [
//       "84",
//       "58",
//       "89",
//       "93",
//       "69",
//       "77",
//       "89"
//     ],
//     "total_grade": "",
//     "total": 475,
//     "rank": 88,
//     "total_percentage": "79.17"
//   },
//   {
//     "name": "آية مصطفى إبراهيم محمد",
//     "id": 20008,
//     "degrees": [
//       "80",
//       "69",
//       "86",
//       "92",
//       "70",
//       "79",
//       "78"
//     ],
//     "total_grade": "",
//     "total": 474,
//     "rank": 89,
//     "total_percentage": "79.00"
//   },
//   {
//     "name": "أمانى عباس أحمد عباس",
//     "id": 20026,
//     "degrees": [
//       "82",
//       "70",
//       "94",
//       "84",
//       "75",
//       "79",
//       "71"
//     ],
//     "total_grade": "",
//     "total": 473,
//     "rank": 90,
//     "total_percentage": "78.83"
//   },
//   {
//     "name": "عمرو سعيد زغبي محمد",
//     "id": 20112,
//     "degrees": [
//       "88",
//       "61",
//       "81",
//       "88",
//       "82",
//       "74",
//       "86"
//     ],
//     "total_grade": "",
//     "total": 472,
//     "rank": 91,
//     "total_percentage": "78.67"
//   },
//   {
//     "name": "مريم رجب العربى الحسانين عبدالواحد",
//     "id": 20146,
//     "degrees": [
//       "74",
//       "79",
//       "63",
//       "95",
//       "85",
//       "75",
//       "75"
//     ],
//     "total_grade": "",
//     "total": 472,
//     "rank": 92,
//     "total_percentage": "78.67"
//   },
//   {
//     "name": "آلاء محمد عبدالجليل محمد",
//     "id": 20005,
//     "degrees": [
//       "82",
//       "72",
//       "83",
//       "94",
//       "71",
//       "64",
//       "86"
//     ],
//     "total_grade": "",
//     "total": 470,
//     "rank": 93,
//     "total_percentage": "78.33"
//   },
//   {
//     "name": "دينا علي عبدالعزيز علي",
//     "id": 20053,
//     "degrees": [
//       "76",
//       "66",
//       "89",
//       "79",
//       "76",
//       "77",
//       "83"
//     ],
//     "total_grade": "",
//     "total": 470,
//     "rank": 94,
//     "total_percentage": "78.33"
//   },
//   {
//     "name": "روان عصام أحمد كامل",
//     "id": 20066,
//     "degrees": [
//       "86",
//       "61",
//       "82",
//       "93",
//       "67",
//       "84",
//       "82"
//     ],
//     "total_grade": "",
//     "total": 469,
//     "rank": 95,
//     "total_percentage": "78.17"
//   },
//   {
//     "name": "ريهام هشام بدوى طه بدوى",
//     "id": 20070,
//     "degrees": [
//       "72",
//       "70",
//       "84",
//       "93",
//       "78",
//       "72",
//       "68"
//     ],
//     "total_grade": "",
//     "total": 465,
//     "rank": 96,
//     "total_percentage": "77.50"
//   },
//   {
//     "name": "رضوى السيد عبدالخالق السيد",
//     "id": 20428,
//     "degrees": [
//       "76",
//       "67",
//       "82",
//       "78",
//       "70",
//       "81",
//       "87"
//     ],
//     "total_grade": "",
//     "total": 465,
//     "rank": 97,
//     "total_percentage": "77.50"
//   },
//   {
//     "name": "ملك السيد محمد عبدالهادى",
//     "id": 20154,
//     "degrees": [
//       "82",
//       "69",
//       "78",
//       "89",
//       "72",
//       "79",
//       "77"
//     ],
//     "total_grade": "",
//     "total": 464,
//     "rank": 98,
//     "total_percentage": "77.33"
//   },
//   {
//     "name": "ملك محمد عبدالنبى محمد علي",
//     "id": 20155,
//     "degrees": [
//       "76",
//       "59",
//       "78",
//       "96",
//       "76",
//       "85",
//       "70"
//     ],
//     "total_grade": "",
//     "total": 464,
//     "rank": 99,
//     "total_percentage": "77.33"
//   },
//   {
//     "name": "نورا أحمد هاشم عبدالحليم",
//     "id": 25088,
//     "degrees": [
//       "82",
//       "76",
//       "89",
//       "81",
//       "76",
//       "73",
//       "69"
//     ],
//     "total_grade": "",
//     "total": 464,
//     "rank": 100,
//     "total_percentage": "77.33"
//   },
//   {
//     "name": "سعد أبوالقاسم سعد حسن على",
//     "id": 20079,
//     "degrees": [
//       "68",
//       "76",
//       "73",
//       "85",
//       "84",
//       "81",
//       "64"
//     ],
//     "total_grade": "",
//     "total": 463,
//     "rank": 101,
//     "total_percentage": "77.17"
//   },
//   {
//     "name": "هويدا محمد أحمد حمزة عبدالرؤف",
//     "id": 20182,
//     "degrees": [
//       "86",
//       "73",
//       "77",
//       "70",
//       "91",
//       "69",
//       "83"
//     ],
//     "total_grade": "",
//     "total": 463,
//     "rank": 102,
//     "total_percentage": "77.17"
//   },
//   {
//     "name": "محمد خالد عبدالحميد محمد أبوعبيه",
//     "id": 20561,
//     "degrees": [
//       "88",
//       "79",
//       "67",
//       "100",
//       "74",
//       "86",
//       "57"
//     ],
//     "total_grade": "",
//     "total": 463,
//     "rank": 103,
//     "total_percentage": "77.17"
//   },
//   {
//     "name": "رزان طارق عبدالرحمن محمد",
//     "id": 20061,
//     "degrees": [
//       "78",
//       "67",
//       "86",
//       "98",
//       "84",
//       "63",
//       "64"
//     ],
//     "total_grade": "",
//     "total": 462,
//     "rank": 104,
//     "total_percentage": "77.00"
//   },
//   {
//     "name": "عبدالرحمن محمود عبدالغنى محمود عبدالغنى",
//     "id": 20103,
//     "degrees": [
//       "80",
//       "62",
//       "91",
//       "85",
//       "77",
//       "66",
//       "81"
//     ],
//     "total_grade": "",
//     "total": 462,
//     "rank": 105,
//     "total_percentage": "77.00"
//   },
//   {
//     "name": "مريم محمود أحمد محمد",
//     "id": 20151,
//     "degrees": [
//       "60",
//       "64",
//       "85",
//       "94",
//       "83",
//       "75",
//       "61"
//     ],
//     "total_grade": "",
//     "total": 462,
//     "rank": 106,
//     "total_percentage": "77.00"
//   },
//   {
//     "name": "أمانى عماد محمود عبدالقادر محمود",
//     "id": 20027,
//     "degrees": [
//       "78",
//       "73",
//       "78",
//       "95",
//       "65",
//       "77",
//       "73"
//     ],
//     "total_grade": "",
//     "total": 461,
//     "rank": 107,
//     "total_percentage": "76.83"
//   },
//   {
//     "name": "هاجر مصطفى علي أحمد محمد الأحرش",
//     "id": 20175,
//     "degrees": [
//       "66",
//       "56",
//       "84",
//       "95",
//       "75",
//       "78",
//       "73"
//     ],
//     "total_grade": "",
//     "total": 461,
//     "rank": 108,
//     "total_percentage": "76.83"
//   },
//   {
//     "name": "هاجر محمد ناصر عيد",
//     "id": 20450,
//     "degrees": [
//       "86",
//       "77",
//       "57",
//       "95",
//       "73",
//       "78",
//       "81"
//     ],
//     "total_grade": "",
//     "total": 461,
//     "rank": 109,
//     "total_percentage": "76.83"
//   },
//   {
//     "name": "دعاء شكري عبدالفتاح مصطفى",
//     "id": 20425,
//     "degrees": [
//       "62",
//       "78",
//       "85",
//       "75",
//       "77",
//       "76",
//       "69"
//     ],
//     "total_grade": "",
//     "total": 460,
//     "rank": 110,
//     "total_percentage": "76.67"
//   },
//   {
//     "name": "منى محمد محمد أحمد مصطفى",
//     "id": 25081,
//     "degrees": [
//       "74",
//       "79",
//       "79",
//       "85",
//       "60",
//       "81",
//       "74"
//     ],
//     "total_grade": "",
//     "total": 458,
//     "rank": 111,
//     "total_percentage": "76.33"
//   },
//   {
//     "name": "مريم محمد إبراهيم السيد",
//     "id": 20150,
//     "degrees": [
//       "76",
//       "63",
//       "67",
//       "92",
//       "78",
//       "85",
//       "72"
//     ],
//     "total_grade": "",
//     "total": 457,
//     "rank": 112,
//     "total_percentage": "76.17"
//   },
//   {
//     "name": "جنى محمود فاروق سيد",
//     "id": 20423,
//     "degrees": [
//       "66",
//       "65",
//       "68",
//       "93",
//       "71",
//       "78",
//       "81"
//     ],
//     "total_grade": "",
//     "total": 456,
//     "rank": 113,
//     "total_percentage": "76.00"
//   },
//   {
//     "name": "شهد علي محمد عبده",
//     "id": 25049,
//     "degrees": [
//       "86",
//       "66",
//       "77",
//       "100",
//       "72",
//       "80",
//       "60"
//     ],
//     "total_grade": "",
//     "total": 455,
//     "rank": 114,
//     "total_percentage": "75.83"
//   },
//   {
//     "name": "هدى سيد على محمد أحمد",
//     "id": 20180,
//     "degrees": [
//       "78",
//       "68",
//       "58",
//       "92",
//       "74",
//       "74",
//       "88"
//     ],
//     "total_grade": "",
//     "total": 454,
//     "rank": 115,
//     "total_percentage": "75.67"
//   },
//   {
//     "name": "رويدا أحمد عارف جمعة",
//     "id": 20069,
//     "degrees": [
//       "84",
//       "62",
//       "75",
//       "93",
//       "67",
//       "81",
//       "75"
//     ],
//     "total_grade": "",
//     "total": 453,
//     "rank": 116,
//     "total_percentage": "75.50"
//   },
//   {
//     "name": "محمد مجدي عبدالنبي الطحاوي",
//     "id": 20134,
//     "degrees": [
//       "80",
//       "69",
//       "80",
//       "85",
//       "77",
//       "80",
//       "62"
//     ],
//     "total_grade": "",
//     "total": 453,
//     "rank": 117,
//     "total_percentage": "75.50"
//   },
//   {
//     "name": "رانيا محمود محمد محمد حسن",
//     "id": 20426,
//     "degrees": [
//       "78",
//       "74",
//       "78",
//       "87",
//       "73",
//       "81",
//       "59"
//     ],
//     "total_grade": "",
//     "total": 452,
//     "rank": 118,
//     "total_percentage": "75.33"
//   },
//   {
//     "name": "بلال محمد سيد على رزق",
//     "id": 20036,
//     "degrees": [
//       "76",
//       "66",
//       "63",
//       "83",
//       "67",
//       "75",
//       "97"
//     ],
//     "total_grade": "",
//     "total": 451,
//     "rank": 119,
//     "total_percentage": "75.17"
//   },
//   {
//     "name": "حفصة أحمد عمر محمود",
//     "id": 20045,
//     "degrees": [
//       "74",
//       "70",
//       "71",
//       "81",
//       "78",
//       "81",
//       "69"
//     ],
//     "total_grade": "",
//     "total": 450,
//     "rank": 120,
//     "total_percentage": "75.00"
//   },
//   {
//     "name": "لقاء عبدالله عبدالعال هلال",
//     "id": 20123,
//     "degrees": [
//       "78",
//       "64",
//       "80",
//       "93",
//       "70",
//       "77",
//       "66"
//     ],
//     "total_grade": "",
//     "total": 450,
//     "rank": 121,
//     "total_percentage": "75.00"
//   },
//   {
//     "name": "أمل عبدالواحد جمعة إمام",
//     "id": 20028,
//     "degrees": [
//       "80",
//       "54",
//       "88",
//       "95",
//       "65",
//       "71",
//       "76"
//     ],
//     "total_grade": "",
//     "total": 449,
//     "rank": 122,
//     "total_percentage": "74.83"
//   },
//   {
//     "name": "محمود حسن حسن محمد الصعيدى",
//     "id": 20138,
//     "degrees": [
//       "72",
//       "69",
//       "53",
//       "86",
//       "71",
//       "80",
//       "90"
//     ],
//     "total_grade": "",
//     "total": 449,
//     "rank": 123,
//     "total_percentage": "74.83"
//   },
//   {
//     "name": "سلمى محمد محمد درديرى",
//     "id": 20083,
//     "degrees": [
//       "82",
//       "66",
//       "93",
//       "83",
//       "53",
//       "74",
//       "79"
//     ],
//     "total_grade": "",
//     "total": 448,
//     "rank": 124,
//     "total_percentage": "74.67"
//   },
//   {
//     "name": "خالد محمد السعيد حسين",
//     "id": 20048,
//     "degrees": [
//       "72",
//       "65",
//       "78",
//       "74",
//       "78",
//       "69",
//       "83"
//     ],
//     "total_grade": "",
//     "total": 447,
//     "rank": 125,
//     "total_percentage": "74.50"
//   },
//   {
//     "name": "يوسف أحمد إبراهيم أحمد",
//     "id": 20190,
//     "degrees": [
//       "74",
//       "60",
//       "75",
//       "88",
//       "70",
//       "84",
//       "70"
//     ],
//     "total_grade": "",
//     "total": 447,
//     "rank": 126,
//     "total_percentage": "74.50"
//   },
//   {
//     "name": "عبدالله محمد عبدالله عبدالله",
//     "id": 25056,
//     "degrees": [
//       "80",
//       "59",
//       "63",
//       "93",
//       "65",
//       "73",
//       "94"
//     ],
//     "total_grade": "",
//     "total": 447,
//     "rank": 127,
//     "total_percentage": "74.50"
//   },
//   {
//     "name": "أميرة عماد مصطفى محمد عبدالحميد",
//     "id": 20421,
//     "degrees": [
//       "54",
//       "68",
//       "77",
//       "81",
//       "77",
//       "74",
//       "69"
//     ],
//     "total_grade": "",
//     "total": 446,
//     "rank": 128,
//     "total_percentage": "74.33"
//   },
//   {
//     "name": "إحسان عادل عبدالكريم محمود",
//     "id": 20011,
//     "degrees": [
//       "78",
//       "68",
//       "70",
//       "74",
//       "87",
//       "60",
//       "86"
//     ],
//     "total_grade": "",
//     "total": 445,
//     "rank": 129,
//     "total_percentage": "74.17"
//   },
//   {
//     "name": "بلال سيد محمد محمد حسن",
//     "id": 20034,
//     "degrees": [
//       "74",
//       "70",
//       "73",
//       "74",
//       "73",
//       "74",
//       "81"
//     ],
//     "total_grade": "",
//     "total": 445,
//     "rank": 130,
//     "total_percentage": "74.17"
//   },
//   {
//     "name": "حمدى حازم شمردن محمد",
//     "id": 20046,
//     "degrees": [
//       "84",
//       "56",
//       "79",
//       "89",
//       "67",
//       "81",
//       "73"
//     ],
//     "total_grade": "",
//     "total": 445,
//     "rank": 131,
//     "total_percentage": "74.17"
//   },
//   {
//     "name": "حبيبة جمعة سيد محمود الطموهى",
//     "id": 25026,
//     "degrees": [
//       "72",
//       "67",
//       "81",
//       "84",
//       "61",
//       "71",
//       "81"
//     ],
//     "total_grade": "",
//     "total": 445,
//     "rank": 132,
//     "total_percentage": "74.17"
//   },
//   {
//     "name": "شهد جمال فهمى عفيفى محمد",
//     "id": 25046,
//     "degrees": [
//       "76",
//       "79",
//       "84",
//       "80",
//       "71",
//       "63",
//       "68"
//     ],
//     "total_grade": "",
//     "total": 445,
//     "rank": 133,
//     "total_percentage": "74.17"
//   },
//   {
//     "name": "فتحية عبدالمعز عبدالتواب أحمد",
//     "id": 20118,
//     "degrees": [
//       "74",
//       "72",
//       "63",
//       "84",
//       "75",
//       "81",
//       "69"
//     ],
//     "total_grade": "",
//     "total": 444,
//     "rank": 134,
//     "total_percentage": "74.00"
//   },
//   {
//     "name": "مروة صبحى عبدالقادر على حجازي",
//     "id": 20144,
//     "degrees": [
//       "88",
//       "74",
//       "81",
//       "86",
//       "73",
//       "64",
//       "66"
//     ],
//     "total_grade": "",
//     "total": 444,
//     "rank": 135,
//     "total_percentage": "74.00"
//   },
//   {
//     "name": "ملك عماد على عبدالحميد على",
//     "id": 20445,
//     "degrees": [
//       "80",
//       "62",
//       "78",
//       "93",
//       "65",
//       "79",
//       "67"
//     ],
//     "total_grade": "",
//     "total": 444,
//     "rank": 136,
//     "total_percentage": "74.00"
//   },
//   {
//     "name": "ياسر بدر دردير محمد حسانين",
//     "id": 25098,
//     "degrees": [
//       "84",
//       "65",
//       "88",
//       "98",
//       "71",
//       "60",
//       "62"
//     ],
//     "total_grade": "",
//     "total": 444,
//     "rank": 137,
//     "total_percentage": "74.00"
//   },
//   {
//     "name": "إسراء سيد عبدالحكيم دياب",
//     "id": 25205,
//     "degrees": [
//       "84",
//       "72",
//       "89",
//       "74",
//       "83",
//       "69",
//       "57"
//     ],
//     "total_grade": "",
//     "total": 444,
//     "rank": 138,
//     "total_percentage": "74.00"
//   },
//   {
//     "name": "نور أحمد عبدالحميد محمد",
//     "id": 20172,
//     "degrees": [
//       "64",
//       "68",
//       "68",
//       "84",
//       "74",
//       "83",
//       "66"
//     ],
//     "total_grade": "",
//     "total": 443,
//     "rank": 139,
//     "total_percentage": "73.83"
//   },
//   {
//     "name": "أسماء سيد محمد سيد",
//     "id": 25014,
//     "degrees": [
//       "72",
//       "79",
//       "66",
//       "93",
//       "71",
//       "55",
//       "79"
//     ],
//     "total_grade": "",
//     "total": 443,
//     "rank": 140,
//     "total_percentage": "73.83"
//   },
//   {
//     "name": "أميرة محمد عبدالمنعم شريف",
//     "id": 25016,
//     "degrees": [
//       "84",
//       "74",
//       "81",
//       "81",
//       "55",
//       "79",
//       "73"
//     ],
//     "total_grade": "",
//     "total": 443,
//     "rank": 141,
//     "total_percentage": "73.83"
//   },
//   {
//     "name": "محمد إسماعيل إبراهيم محمد جاد",
//     "id": 25065,
//     "degrees": [
//       "84",
//       "79",
//       "46",
//       "91",
//       "80",
//       "70",
//       "77"
//     ],
//     "total_grade": "",
//     "total": 443,
//     "rank": 142,
//     "total_percentage": "73.83"
//   },
//   {
//     "name": "باسم أحمد جمال محمد أحمد",
//     "id": 25211,
//     "degrees": [
//       "78",
//       "67",
//       "81",
//       "90",
//       "65",
//       "74",
//       "65"
//     ],
//     "total_grade": "",
//     "total": 442,
//     "rank": 143,
//     "total_percentage": "73.67"
//   },
//   {
//     "name": "أحمد فتحي علي ذكي البرعي",
//     "id": 20013,
//     "degrees": [
//       "66",
//       "66",
//       "75",
//       "97",
//       "48",
//       "73",
//       "82"
//     ],
//     "total_grade": "",
//     "total": 441,
//     "rank": 144,
//     "total_percentage": "73.50"
//   },
//   {
//     "name": "ندى بدر محمود محمود عبدالحميد",
//     "id": 20167,
//     "degrees": [
//       "80",
//       "57",
//       "70",
//       "83",
//       "81",
//       "79",
//       "70"
//     ],
//     "total_grade": "",
//     "total": 440,
//     "rank": 145,
//     "total_percentage": "73.33"
//   },
//   {
//     "name": "حسام طارق رشاد عبدالعزيز",
//     "id": 20424,
//     "degrees": [
//       "64",
//       "75",
//       "80",
//       "50",
//       "85",
//       "65",
//       "85"
//     ],
//     "total_grade": "",
//     "total": 440,
//     "rank": 146,
//     "total_percentage": "73.33"
//   },
//   {
//     "name": "عمر عبدالسلام محمد فتحى عبدالسلام",
//     "id": 20441,
//     "degrees": [
//       "82",
//       "72",
//       "86",
//       "50",
//       "78",
//       "74",
//       "80"
//     ],
//     "total_grade": "",
//     "total": 440,
//     "rank": 147,
//     "total_percentage": "73.33"
//   },
//   {
//     "name": "سارة إبراهيم قرنى صالح عبدالواحد",
//     "id": 20076,
//     "degrees": [
//       "74",
//       "77",
//       "76",
//       "89",
//       "62",
//       "69",
//       "66"
//     ],
//     "total_grade": "",
//     "total": 439,
//     "rank": 148,
//     "total_percentage": "73.17"
//   },
//   {
//     "name": "محمود عادل محمد أحمد متولى",
//     "id": 20139,
//     "degrees": [
//       "66",
//       "68",
//       "55",
//       "86",
//       "67",
//       "64",
//       "99"
//     ],
//     "total_grade": "",
//     "total": 439,
//     "rank": 149,
//     "total_percentage": "73.17"
//   },
//   {
//     "name": "سلمى سيد أحمد عبدالعال",
//     "id": 20432,
//     "degrees": [
//       "84",
//       "73",
//       "73",
//       "94",
//       "74",
//       "79",
//       "46"
//     ],
//     "total_grade": "",
//     "total": 439,
//     "rank": 150,
//     "total_percentage": "73.17"
//   },
//   {
//     "name": "خالد أحمد عبدالقادر عبداللطيف",
//     "id": 25215,
//     "degrees": [
//       "60",
//       "77",
//       "71",
//       "83",
//       "58",
//       "70",
//       "80"
//     ],
//     "total_grade": "",
//     "total": 439,
//     "rank": 151,
//     "total_percentage": "73.17"
//   },
//   {
//     "name": "فرح محمود محمود محمد حسين",
//     "id": 20119,
//     "degrees": [
//       "80",
//       "71",
//       "79",
//       "85",
//       "60",
//       "78",
//       "63"
//     ],
//     "total_grade": "",
//     "total": 436,
//     "rank": 152,
//     "total_percentage": "72.67"
//   },
//   {
//     "name": "منةالله محمد محمدين ولي",
//     "id": 25237,
//     "degrees": [
//       "80",
//       "72",
//       "62",
//       "85",
//       "66",
//       "75",
//       "76"
//     ],
//     "total_grade": "",
//     "total": 436,
//     "rank": 153,
//     "total_percentage": "72.67"
//   },
//   {
//     "name": "فاطمة محمد سعد حسين",
//     "id": 20115,
//     "degrees": [
//       "76",
//       "64",
//       "62",
//       "87",
//       "73",
//       "74",
//       "75"
//     ],
//     "total_grade": "",
//     "total": 435,
//     "rank": 154,
//     "total_percentage": "72.50"
//   },
//   {
//     "name": "وفاء جمال رمضان محمد",
//     "id": 20183,
//     "degrees": [
//       "76",
//       "66",
//       "56",
//       "88",
//       "70",
//       "84",
//       "70"
//     ],
//     "total_grade": "",
//     "total": 434,
//     "rank": 155,
//     "total_percentage": "72.33"
//   },
//   {
//     "name": "وردة أبوالخير طه عاصي",
//     "id": 20451,
//     "degrees": [
//       "84",
//       "69",
//       "40",
//       "87",
//       "71",
//       "87",
//       "78"
//     ],
//     "total_grade": "",
//     "total": 432,
//     "rank": 156,
//     "total_percentage": "72.00"
//   },
//   {
//     "name": "زينب مصطفى كامل محمد حسن",
//     "id": 20075,
//     "degrees": [
//       "74",
//       "62",
//       "77",
//       "83",
//       "59",
//       "75",
//       "75"
//     ],
//     "total_grade": "",
//     "total": 431,
//     "rank": 157,
//     "total_percentage": "71.83"
//   },
//   {
//     "name": "نور وليد أحمد محمد أحمد",
//     "id": 20173,
//     "degrees": [
//       "74",
//       "69",
//       "81",
//       "69",
//       "67",
//       "71",
//       "74"
//     ],
//     "total_grade": "",
//     "total": 431,
//     "rank": 158,
//     "total_percentage": "71.83"
//   },
//   {
//     "name": "آية رمضان محمد عبدالعال محمد",
//     "id": 25202,
//     "degrees": [
//       "74",
//       "61",
//       "72",
//       "85",
//       "78",
//       "69",
//       "66"
//     ],
//     "total_grade": "",
//     "total": 431,
//     "rank": 159,
//     "total_percentage": "71.83"
//   },
//   {
//     "name": "آية عمرو عبدالعزيز السيد الصيفى",
//     "id": 20007,
//     "degrees": [
//       "66",
//       "59",
//       "75",
//       "86",
//       "69",
//       "71",
//       "70"
//     ],
//     "total_grade": "",
//     "total": 430,
//     "rank": 160,
//     "total_percentage": "71.67"
//   },
//   {
//     "name": "روان محمد سعيد أنور محمد",
//     "id": 20067,
//     "degrees": [
//       "84",
//       "58",
//       "79",
//       "76",
//       "71",
//       "76",
//       "70"
//     ],
//     "total_grade": "",
//     "total": 430,
//     "rank": 161,
//     "total_percentage": "71.67"
//   },
//   {
//     "name": "أمانى سعد محمد محمد على سالم",
//     "id": 20025,
//     "degrees": [
//       "74",
//       "79",
//       "73",
//       "78",
//       "41",
//       "73",
//       "85"
//     ],
//     "total_grade": "",
//     "total": 429,
//     "rank": 162,
//     "total_percentage": "71.50"
//   },
//   {
//     "name": "عمر عطية إبراهيم محمود",
//     "id": 25057,
//     "degrees": [
//       "84",
//       "65",
//       "73",
//       "83",
//       "69",
//       "81",
//       "58"
//     ],
//     "total_grade": "",
//     "total": 429,
//     "rank": 163,
//     "total_percentage": "71.50"
//   },
//   {
//     "name": "هدير عبدالجواد محمد عواد غراب",
//     "id": 20181,
//     "degrees": [
//       "70",
//       "56",
//       "78",
//       "81",
//       "70",
//       "73",
//       "70"
//     ],
//     "total_grade": "",
//     "total": 428,
//     "rank": 164,
//     "total_percentage": "71.33"
//   },
//   {
//     "name": "حبيبة أيمن سامى سيد قطب",
//     "id": 25025,
//     "degrees": [
//       "80",
//       "62",
//       "71",
//       "86",
//       "67",
//       "72",
//       "69"
//     ],
//     "total_grade": "",
//     "total": 427,
//     "rank": 165,
//     "total_percentage": "71.17"
//   },
//   {
//     "name": "بلال محمد يونس محمد",
//     "id": 20037,
//     "degrees": [
//       "72",
//       "68",
//       "61",
//       "85",
//       "54",
//       "84",
//       "74"
//     ],
//     "total_grade": "",
//     "total": 426,
//     "rank": 166,
//     "total_percentage": "71.00"
//   },
//   {
//     "name": "نورا أشرف محمد عمر",
//     "id": 20174,
//     "degrees": [
//       "68",
//       "60",
//       "69",
//       "79",
//       "78",
//       "82",
//       "58"
//     ],
//     "total_grade": "",
//     "total": 426,
//     "rank": 167,
//     "total_percentage": "71.00"
//   },
//   {
//     "name": "محمود محمد محجوب إسماعيل",
//     "id": 20142,
//     "degrees": [
//       "58",
//       "54",
//       "73",
//       "71",
//       "67",
//       "78",
//       "80"
//     ],
//     "total_grade": "",
//     "total": 423,
//     "rank": 168,
//     "total_percentage": "70.50"
//   },
//   {
//     "name": "هبة إبراهيم محمد ذكي",
//     "id": 20178,
//     "degrees": [
//       "86",
//       "62",
//       "54",
//       "88",
//       "70",
//       "86",
//       "63"
//     ],
//     "total_grade": "",
//     "total": 423,
//     "rank": 169,
//     "total_percentage": "70.50"
//   },
//   {
//     "name": "عمر أشرف سيد نعمان",
//     "id": 20440,
//     "degrees": [
//       "70",
//       "57",
//       "87",
//       "89",
//       "57",
//       "78",
//       "55"
//     ],
//     "total_grade": "",
//     "total": 423,
//     "rank": 170,
//     "total_percentage": "70.50"
//   },
//   {
//     "name": "ملك محمد كمال محمد",
//     "id": 25078,
//     "degrees": [
//       "80",
//       "76",
//       "75",
//       "79",
//       "43",
//       "75",
//       "75"
//     ],
//     "total_grade": "",
//     "total": 423,
//     "rank": 171,
//     "total_percentage": "70.50"
//   },
//   {
//     "name": "دعاء محمد يسن صابر",
//     "id": 20050,
//     "degrees": [
//       "72",
//       "56",
//       "78",
//       "77",
//       "69",
//       "73",
//       "69"
//     ],
//     "total_grade": "",
//     "total": 422,
//     "rank": 172,
//     "total_percentage": "70.33"
//   },
//   {
//     "name": "رحمة مجدى محمد إمام محمد زيدان",
//     "id": 20059,
//     "degrees": [
//       "86",
//       "58",
//       "82",
//       "84",
//       "66",
//       "75",
//       "57"
//     ],
//     "total_grade": "",
//     "total": 422,
//     "rank": 173,
//     "total_percentage": "70.33"
//   },
//   {
//     "name": "أسماء أبوزيد محمد أحمد",
//     "id": 25013,
//     "degrees": [
//       "86",
//       "67",
//       "75",
//       "93",
//       "62",
//       "72",
//       "53"
//     ],
//     "total_grade": "",
//     "total": 422,
//     "rank": 174,
//     "total_percentage": "70.33"
//   },
//   {
//     "name": "رضوى محمد سيد حسن",
//     "id": 20064,
//     "degrees": [
//       "68",
//       "55",
//       "86",
//       "56",
//       "71",
//       "73",
//       "80"
//     ],
//     "total_grade": "",
//     "total": 421,
//     "rank": 175,
//     "total_percentage": "70.17"
//   },
//   {
//     "name": "محمد خليفة فتحى محمد",
//     "id": 20130,
//     "degrees": [
//       "70",
//       "60",
//       "77",
//       "77",
//       "67",
//       "72",
//       "67"
//     ],
//     "total_grade": "",
//     "total": 420,
//     "rank": 176,
//     "total_percentage": "70.00"
//   },
//   {
//     "name": "مروة أشرف رمضان عبدالرحيم",
//     "id": 20443,
//     "degrees": [
//       "84",
//       "75",
//       "85",
//       "50",
//       "75",
//       "50",
//       "85"
//     ],
//     "total_grade": "",
//     "total": 420,
//     "rank": 177,
//     "total_percentage": "70.00"
//   },
//   {
//     "name": "إسراء أيمن محمد بكر حميده",
//     "id": 20019,
//     "degrees": [
//       "64",
//       "72",
//       "40",
//       "91",
//       "59",
//       "82",
//       "75"
//     ],
//     "total_grade": "",
//     "total": 419,
//     "rank": 178,
//     "total_percentage": "69.83"
//   },
//   {
//     "name": "رانيا ياسر جلال علي حسن",
//     "id": 20427,
//     "degrees": [
//       "64",
//       "68",
//       "81",
//       "60",
//       "56",
//       "89",
//       "65"
//     ],
//     "total_grade": "",
//     "total": 419,
//     "rank": 179,
//     "total_percentage": "69.83"
//   },
//   {
//     "name": "أحمد محمد أحمد عطية محمد",
//     "id": 25005,
//     "degrees": [
//       "76",
//       "58",
//       "79",
//       "89",
//       "59",
//       "76",
//       "57"
//     ],
//     "total_grade": "",
//     "total": 418,
//     "rank": 180,
//     "total_percentage": "69.67"
//   },
//   {
//     "name": "سلسبيل إبراهيم طنطاوي إبراهيم",
//     "id": 20081,
//     "degrees": [
//       "68",
//       "74",
//       "69",
//       "79",
//       "67",
//       "66",
//       "60"
//     ],
//     "total_grade": "",
//     "total": 415,
//     "rank": 181,
//     "total_percentage": "69.17"
//   },
//   {
//     "name": "شروق هاني مندي حسن ابراهيم",
//     "id": 20088,
//     "degrees": [
//       "74",
//       "63",
//       "68",
//       "88",
//       "58",
//       "75",
//       "63"
//     ],
//     "total_grade": "",
//     "total": 415,
//     "rank": 182,
//     "total_percentage": "69.17"
//   },
//   {
//     "name": "ولاء صلاح الدين شعبان مطاوع",
//     "id": 20452,
//     "degrees": [
//       "78",
//       "63",
//       "74",
//       "69",
//       "61",
//       "79",
//       "69"
//     ],
//     "total_grade": "",
//     "total": 415,
//     "rank": 183,
//     "total_percentage": "69.17"
//   },
//   {
//     "name": "عبدالرحمن مصطفى رمضان محمد",
//     "id": 25055,
//     "degrees": [
//       "78",
//       "62",
//       "76",
//       "71",
//       "73",
//       "78",
//       "55"
//     ],
//     "total_grade": "",
//     "total": 415,
//     "rank": 184,
//     "total_percentage": "69.17"
//   },
//   {
//     "name": "رضوى ياسر ربيع عبدالسميع منصور",
//     "id": 20429,
//     "degrees": [
//       "84",
//       "66",
//       "82",
//       "64",
//       "66",
//       "78",
//       "58"
//     ],
//     "total_grade": "",
//     "total": 414,
//     "rank": 185,
//     "total_percentage": "69.00"
//   },
//   {
//     "name": "هبة محمود محمد حسن أحمد",
//     "id": 20179,
//     "degrees": [
//       "82",
//       "62",
//       "71",
//       "80",
//       "65",
//       "70",
//       "64"
//     ],
//     "total_grade": "",
//     "total": 412,
//     "rank": 186,
//     "total_percentage": "68.67"
//   },
//   {
//     "name": "روضة عوض عبدالدايم حمد",
//     "id": 20430,
//     "degrees": [
//       "78",
//       "66",
//       "70",
//       "73",
//       "74",
//       "75",
//       "54"
//     ],
//     "total_grade": "",
//     "total": 412,
//     "rank": 187,
//     "total_percentage": "68.67"
//   },
//   {
//     "name": "إبراهيم عبدالوهاب مصطفى إبراهيم كامل",
//     "id": 20010,
//     "degrees": [
//       "68",
//       "70",
//       "46",
//       "55",
//       "83",
//       "84",
//       "72"
//     ],
//     "total_grade": "",
//     "total": 410,
//     "rank": 188,
//     "total_percentage": "68.33"
//   },
//   {
//     "name": "رضوى على إبراهيم حسن",
//     "id": 20063,
//     "degrees": [
//       "74",
//       "50",
//       "88",
//       "61",
//       "78",
//       "64",
//       "67"
//     ],
//     "total_grade": "",
//     "total": 408,
//     "rank": 189,
//     "total_percentage": "68.00"
//   },
//   {
//     "name": "بسملة عادل ياقوت عبدالفتاح علام",
//     "id": 20033,
//     "degrees": [
//       "72",
//       "58",
//       "78",
//       "78",
//       "65",
//       "73",
//       "55"
//     ],
//     "total_grade": "",
//     "total": 407,
//     "rank": 190,
//     "total_percentage": "67.83"
//   },
//   {
//     "name": "عبدالرحمن محمد عبدالرازق بدرى",
//     "id": 20102,
//     "degrees": [
//       "72",
//       "67",
//       "50",
//       "84",
//       "63",
//       "82",
//       "59"
//     ],
//     "total_grade": "",
//     "total": 405,
//     "rank": 191,
//     "total_percentage": "67.50"
//   },
//   {
//     "name": "فتحي سعيد فتحي مرداش على",
//     "id": 25457,
//     "degrees": [
//       "84",
//       "79",
//       "48",
//       "78",
//       "75",
//       "67",
//       "57"
//     ],
//     "total_grade": "",
//     "total": 404,
//     "rank": 192,
//     "total_percentage": "67.33"
//   },
//   {
//     "name": "كريم محمود أحمد سيد أحمد",
//     "id": 20121,
//     "degrees": [
//       "86",
//       "71",
//       "60",
//       "84",
//       "57",
//       "64",
//       "66"
//     ],
//     "total_grade": "",
//     "total": 402,
//     "rank": 193,
//     "total_percentage": "67.00"
//   },
//   {
//     "name": "عبدالله مطر عيفان جابر",
//     "id": 20305,
//     "degrees": [
//       "64",
//       "64",
//       "80",
//       "82",
//       "48",
//       "68",
//       "60"
//     ],
//     "total_grade": "",
//     "total": 402,
//     "rank": 194,
//     "total_percentage": "67.00"
//   },
//   {
//     "name": "إسراء أشرف محمد سالم عيد",
//     "id": 25009,
//     "degrees": [
//       "76",
//       "69",
//       "70",
//       "80",
//       "50",
//       "78",
//       "55"
//     ],
//     "total_grade": "",
//     "total": 402,
//     "rank": 195,
//     "total_percentage": "67.00"
//   },
//   {
//     "name": "رانيا مصطفى عبدالصبور أحمد",
//     "id": 20055,
//     "degrees": [
//       "72",
//       "53",
//       "71",
//       "81",
//       "57",
//       "69",
//       "70"
//     ],
//     "total_grade": "",
//     "total": 401,
//     "rank": 196,
//     "total_percentage": "66.83"
//   },
//   {
//     "name": "سارة كاره إبراهيم مغاوري",
//     "id": 25039,
//     "degrees": [
//       "86",
//       "55",
//       "66",
//       "79",
//       "73",
//       "81",
//       "47"
//     ],
//     "total_grade": "",
//     "total": 401,
//     "rank": 197,
//     "total_percentage": "66.83"
//   },
//   {
//     "name": "منى سيد حسن بخيت",
//     "id": 25240,
//     "degrees": [
//       "58",
//       "66",
//       "55",
//       "75",
//       "57",
//       "73",
//       "75"
//     ],
//     "total_grade": "",
//     "total": 401,
//     "rank": 198,
//     "total_percentage": "66.83"
//   },
//   {
//     "name": "ندى رمضان محمد أحمد",
//     "id": 20168,
//     "degrees": [
//       "76",
//       "58",
//       "61",
//       "71",
//       "70",
//       "86",
//       "54"
//     ],
//     "total_grade": "",
//     "total": 400,
//     "rank": 199,
//     "total_percentage": "66.67"
//   },
//   {
//     "name": "سها طارق أحمد عبدالله",
//     "id": 20086,
//     "degrees": [
//       "62",
//       "60",
//       "76",
//       "84",
//       "56",
//       "68",
//       "55"
//     ],
//     "total_grade": "",
//     "total": 399,
//     "rank": 200,
//     "total_percentage": "66.50"
//   },
//   {
//     "name": "إيمان ناصر إسماعيل عبدالله",
//     "id": 20422,
//     "degrees": [
//       "80",
//       "53",
//       "80",
//       "87",
//       "61",
//       "64",
//       "54"
//     ],
//     "total_grade": "",
//     "total": 399,
//     "rank": 201,
//     "total_percentage": "66.50"
//   },
//   {
//     "name": "عبدالرحمن سعيد سعيد عفيفى خلف",
//     "id": 20437,
//     "degrees": [
//       "68",
//       "56",
//       "73",
//       "68",
//       "60",
//       "65",
//       "77"
//     ],
//     "total_grade": "",
//     "total": 399,
//     "rank": 202,
//     "total_percentage": "66.50"
//   },
//   {
//     "name": "محمود عبدالتواب محمود عبدالنبي",
//     "id": 20140,
//     "degrees": [
//       "68",
//       "60",
//       "56",
//       "80",
//       "70",
//       "74",
//       "58"
//     ],
//     "total_grade": "",
//     "total": 398,
//     "rank": 203,
//     "total_percentage": "66.33"
//   },
//   {
//     "name": "يه شيويه تشنغ",
//     "id": 20318,
//     "degrees": [
//       "86",
//       "57",
//       "80",
//       "87",
//       "43",
//       "57",
//       "74"
//     ],
//     "total_grade": "",
//     "total": 398,
//     "rank": 204,
//     "total_percentage": "66.33"
//   },
//   {
//     "name": "ريهام حسن السيد محمد",
//     "id": 20431,
//     "degrees": [
//       "76",
//       "53",
//       "78",
//       "69",
//       "66",
//       "69",
//       "63"
//     ],
//     "total_grade": "",
//     "total": 398,
//     "rank": 205,
//     "total_percentage": "66.33"
//   },
//   {
//     "name": "سلمى محمود محمد محمود",
//     "id": 20084,
//     "degrees": [
//       "68",
//       "37",
//       "84",
//       "80",
//       "75",
//       "63",
//       "58"
//     ],
//     "total_grade": "",
//     "total": 397,
//     "rank": 206,
//     "total_percentage": "66.17"
//   },
//   {
//     "name": "حبيبة علاءالدين فتحي محمد",
//     "id": 20043,
//     "degrees": [
//       "60",
//       "68",
//       "57",
//       "59",
//       "69",
//       "68",
//       "75"
//     ],
//     "total_grade": "",
//     "total": 396,
//     "rank": 207,
//     "total_percentage": "66.00"
//   },
//   {
//     "name": "شهد محمود محمد محمود",
//     "id": 20093,
//     "degrees": [
//       "62",
//       "55",
//       "75",
//       "75",
//       "55",
//       "73",
//       "62"
//     ],
//     "total_grade": "",
//     "total": 395,
//     "rank": 208,
//     "total_percentage": "65.83"
//   },
//   {
//     "name": "عبدالرحمن نعمه وحيد موحان الشمرى",
//     "id": 20105,
//     "degrees": [
//       "80",
//       "58",
//       "88",
//       "74",
//       "54",
//       "61",
//       "60"
//     ],
//     "total_grade": "",
//     "total": 395,
//     "rank": 209,
//     "total_percentage": "65.83"
//   },
//   {
//     "name": "نورهان وحيد سعيد مولد",
//     "id": 20449,
//     "degrees": [
//       "82",
//       "57",
//       "86",
//       "69",
//       "60",
//       "67",
//       "56"
//     ],
//     "total_grade": "",
//     "total": 395,
//     "rank": 210,
//     "total_percentage": "65.83"
//   },
//   {
//     "name": "جزاع متعب جزاع فريح العنزى",
//     "id": 20040,
//     "degrees": [
//       "80",
//       "61",
//       "84",
//       "49",
//       "61",
//       "68",
//       "71"
//     ],
//     "total_grade": "",
//     "total": 394,
//     "rank": 211,
//     "total_percentage": "65.67"
//   },
//   {
//     "name": "كريمة أيمن عبدالغفار الشاذلي",
//     "id": 25063,
//     "degrees": [
//       "84",
//       "59",
//       "71",
//       "66",
//       "60",
//       "65",
//       "73"
//     ],
//     "total_grade": "",
//     "total": 394,
//     "rank": 212,
//     "total_percentage": "65.67"
//   },
//   {
//     "name": "عبدالله إسماعيل عامر بكرى",
//     "id": 20439,
//     "degrees": [
//       "76",
//       "47",
//       "82",
//       "59",
//       "58",
//       "68",
//       "79"
//     ],
//     "total_grade": "",
//     "total": 393,
//     "rank": 213,
//     "total_percentage": "65.50"
//   },
//   {
//     "name": "نادية محمود رفعت محمود",
//     "id": 20448,
//     "degrees": [
//       "64",
//       "71",
//       "80",
//       "64",
//       "61",
//       "64",
//       "53"
//     ],
//     "total_grade": "",
//     "total": 393,
//     "rank": 214,
//     "total_percentage": "65.50"
//   },
//   {
//     "name": "هاجر عاطف عبدالمنعم شحاتة محمد",
//     "id": 25092,
//     "degrees": [
//       "70",
//       "58",
//       "82",
//       "76",
//       "46",
//       "60",
//       "71"
//     ],
//     "total_grade": "",
//     "total": 393,
//     "rank": 215,
//     "total_percentage": "65.50"
//   },
//   {
//     "name": "هاجر محمد عبدالقادر محمد إبراهيم",
//     "id": 25349,
//     "degrees": [
//       "74",
//       "50",
//       "90",
//       "75",
//       "50",
//       "70",
//       "56"
//     ],
//     "total_grade": "",
//     "total": 391,
//     "rank": 216,
//     "total_percentage": "65.17"
//   },
//   {
//     "name": "محمد رفعت زكي عبدالعزيز",
//     "id": 25228,
//     "degrees": [
//       "80",
//       "67",
//       "58",
//       "92",
//       "45",
//       "59",
//       "69"
//     ],
//     "total_grade": "",
//     "total": 390,
//     "rank": 217,
//     "total_percentage": "65.00"
//   },
//   {
//     "name": "صهيب مصطفى محمد إبراهيم",
//     "id": 20095,
//     "degrees": [
//       "80",
//       "53",
//       "84",
//       "72",
//       "55",
//       "59",
//       "65"
//     ],
//     "total_grade": "",
//     "total": 388,
//     "rank": 218,
//     "total_percentage": "64.67"
//   },
//   {
//     "name": "شهد مدحت زكي عبدالمالك",
//     "id": 20436,
//     "degrees": [
//       "84",
//       "52",
//       "81",
//       "72",
//       "64",
//       "75",
//       "44"
//     ],
//     "total_grade": "",
//     "total": 388,
//     "rank": 219,
//     "total_percentage": "64.67"
//   },
//   {
//     "name": "محمد خالد محمد حامد كشك",
//     "id": 25066,
//     "degrees": [
//       "60",
//       "57",
//       "36",
//       "93",
//       "67",
//       "62",
//       "72"
//     ],
//     "total_grade": "",
//     "total": 387,
//     "rank": 220,
//     "total_percentage": "64.50"
//   },
//   {
//     "name": "أسماء محمد السيد أحمد سالم",
//     "id": 25209,
//     "degrees": [
//       "74",
//       "63",
//       "58",
//       "79",
//       "64",
//       "69",
//       "54"
//     ],
//     "total_grade": "",
//     "total": 387,
//     "rank": 221,
//     "total_percentage": "64.50"
//   },
//   {
//     "name": "محمد مجيد ساجد ديوان",
//     "id": 20135,
//     "degrees": [
//       "56",
//       "54",
//       "77",
//       "81",
//       "72",
//       "56",
//       "46"
//     ],
//     "total_grade": "",
//     "total": 386,
//     "rank": 222,
//     "total_percentage": "64.33"
//   },
//   {
//     "name": "رحمة محمد محمد أحمد",
//     "id": 25032,
//     "degrees": [
//       "82",
//       "70",
//       "62",
//       "73",
//       "62",
//       "64",
//       "55"
//     ],
//     "total_grade": "",
//     "total": 386,
//     "rank": 223,
//     "total_percentage": "64.33"
//   },
//   {
//     "name": "يوسف أحمد شوين محمد الدليل",
//     "id": 25099,
//     "degrees": [
//       "66",
//       "74",
//       "56",
//       "82",
//       "56",
//       "62",
//       "56"
//     ],
//     "total_grade": "",
//     "total": 386,
//     "rank": 224,
//     "total_percentage": "64.33"
//   },
//   {
//     "name": "أحمد مرجى صالح فالح الرشيدى",
//     "id": 20015,
//     "degrees": [
//       "86",
//       "44",
//       "83",
//       "69",
//       "60",
//       "65",
//       "64"
//     ],
//     "total_grade": "",
//     "total": 385,
//     "rank": 225,
//     "total_percentage": "64.17"
//   },
//   {
//     "name": "نادية على حلمى إسماعيل",
//     "id": 20165,
//     "degrees": [
//       "68",
//       "46",
//       "79",
//       "67",
//       "70",
//       "68",
//       "55"
//     ],
//     "total_grade": "",
//     "total": 385,
//     "rank": 226,
//     "total_percentage": "64.17"
//   },
//   {
//     "name": "يعقوب هادى خزعل على",
//     "id": 20189,
//     "degrees": [
//       "64",
//       "59",
//       "83",
//       "72",
//       "70",
//       "51",
//       "50"
//     ],
//     "total_grade": "",
//     "total": 385,
//     "rank": 227,
//     "total_percentage": "64.17"
//   },
//   {
//     "name": "مريم عبدالعظيم سيد أحمد حسن",
//     "id": 20148,
//     "degrees": [
//       "68",
//       "59",
//       "61",
//       "81",
//       "63",
//       "62",
//       "58"
//     ],
//     "total_grade": "",
//     "total": 384,
//     "rank": 228,
//     "total_percentage": "64.00"
//   },
//   {
//     "name": "سميرة سليمان عدلي محمود",
//     "id": 25042,
//     "degrees": [
//       "80",
//       "56",
//       "77",
//       "62",
//       "50",
//       "73",
//       "65"
//     ],
//     "total_grade": "",
//     "total": 383,
//     "rank": 229,
//     "total_percentage": "63.83"
//   },
//   {
//     "name": "هبة سامي فهمي عبدالسميع محمد",
//     "id": 25093,
//     "degrees": [
//       "74",
//       "74",
//       "71",
//       "78",
//       "43",
//       "64",
//       "53"
//     ],
//     "total_grade": "",
//     "total": 383,
//     "rank": 230,
//     "total_percentage": "63.83"
//   },
//   {
//     "name": "عمر حسني عبدالحميد سيد محمد",
//     "id": 20110,
//     "degrees": [
//       "80",
//       "50",
//       "58",
//       "60",
//       "70",
//       "64",
//       "79"
//     ],
//     "total_grade": "",
//     "total": 381,
//     "rank": 231,
//     "total_percentage": "63.50"
//   },
//   {
//     "name": "نورا حسان على سالم حسان",
//     "id": 25089,
//     "degrees": [
//       "74",
//       "63",
//       "66",
//       "76",
//       "50",
//       "68",
//       "58"
//     ],
//     "total_grade": "",
//     "total": 381,
//     "rank": 232,
//     "total_percentage": "63.50"
//   },
//   {
//     "name": "حبيبة محمد سالم حسن",
//     "id": 25027,
//     "degrees": [
//       "84",
//       "76",
//       "43",
//       "77",
//       "59",
//       "66",
//       "58"
//     ],
//     "total_grade": "",
//     "total": 379,
//     "rank": 233,
//     "total_percentage": "63.17"
//   },
//   {
//     "name": "منةالله جابر محمد راشد الغندور",
//     "id": 20160,
//     "degrees": [
//       "78",
//       "63",
//       "49",
//       "71",
//       "66",
//       "79",
//       "50"
//     ],
//     "total_grade": "",
//     "total": 378,
//     "rank": 234,
//     "total_percentage": "63.00"
//   },
//   {
//     "name": "رحاب أيمن على محمد",
//     "id": 20057,
//     "degrees": [
//       "84",
//       "53",
//       "72",
//       "49",
//       "60",
//       "78",
//       "65"
//     ],
//     "total_grade": "",
//     "total": 377,
//     "rank": 235,
//     "total_percentage": "62.83"
//   },
//   {
//     "name": "أحمد السيد إبراهيم حسن أحمد",
//     "id": 20553,
//     "degrees": [
//       "64",
//       "58",
//       "64",
//       "63",
//       "64",
//       "64",
//       "64"
//     ],
//     "total_grade": "",
//     "total": 377,
//     "rank": 236,
//     "total_percentage": "62.83"
//   },
//   {
//     "name": "مصطفى خالد عنانى أبوسريع",
//     "id": 20153,
//     "degrees": [
//       "72",
//       "56",
//       "29",
//       "80",
//       "76",
//       "74",
//       "61"
//     ],
//     "total_grade": "",
//     "total": 376,
//     "rank": 237,
//     "total_percentage": "62.67"
//   },
//   {
//     "name": "أشرقت صبري عبدالسلام محمد إبراهيم موسى",
//     "id": 20419,
//     "degrees": [
//       "60",
//       "62",
//       "54",
//       "82",
//       "49",
//       "72",
//       "57"
//     ],
//     "total_grade": "",
//     "total": 376,
//     "rank": 238,
//     "total_percentage": "62.67"
//   },
//   {
//     "name": "منيرة عاطف حمدان سليمان آدم",
//     "id": 20162,
//     "degrees": [
//       "60",
//       "49",
//       "66",
//       "87",
//       "63",
//       "75",
//       "34"
//     ],
//     "total_grade": "",
//     "total": 374,
//     "rank": 239,
//     "total_percentage": "62.33"
//   },
//   {
//     "name": "مريم أشرف عبدالتواب كامل",
//     "id": 25233,
//     "degrees": [
//       "86",
//       "62",
//       "73",
//       "50",
//       "62",
//       "57",
//       "70"
//     ],
//     "total_grade": "",
//     "total": 374,
//     "rank": 240,
//     "total_percentage": "62.33"
//   },
//   {
//     "name": "منةالله مصطفى حفظي محمد على",
//     "id": 25080,
//     "degrees": [
//       "76",
//       "55",
//       "73",
//       "74",
//       "51",
//       "71",
//       "47"
//     ],
//     "total_grade": "",
//     "total": 371,
//     "rank": 241,
//     "total_percentage": "61.83"
//   },
//   {
//     "name": "دعاء محمد أحمد مصطفى",
//     "id": 20049,
//     "degrees": [
//       "68",
//       "55",
//       "73",
//       "71",
//       "48",
//       "72",
//       "51"
//     ],
//     "total_grade": "",
//     "total": 370,
//     "rank": 242,
//     "total_percentage": "61.67"
//   },
//   {
//     "name": "علاء الدين إبراهيم محمد إبراهيم",
//     "id": 20108,
//     "degrees": [
//       "80",
//       "59",
//       "59",
//       "84",
//       "50",
//       "62",
//       "56"
//     ],
//     "total_grade": "",
//     "total": 370,
//     "rank": 243,
//     "total_percentage": "61.67"
//   },
//   {
//     "name": "فواز على متعب سليمان الشمرى",
//     "id": 20120,
//     "degrees": [
//       "74",
//       "73",
//       "36",
//       "71",
//       "58",
//       "79",
//       "53"
//     ],
//     "total_grade": "",
//     "total": 370,
//     "rank": 244,
//     "total_percentage": "61.67"
//   },
//   {
//     "name": "مريم عماد عشري أحمد سيد",
//     "id": 20149,
//     "degrees": [
//       "72",
//       "55",
//       "81",
//       "62",
//       "47",
//       "61",
//       "63"
//     ],
//     "total_grade": "",
//     "total": 369,
//     "rank": 245,
//     "total_percentage": "61.50"
//   },
//   {
//     "name": "هبة عاطف عبدالمنعم شحاتة محمد",
//     "id": 25244,
//     "degrees": [
//       "68",
//       "45",
//       "84",
//       "82",
//       "46",
//       "48",
//       "64"
//     ],
//     "total_grade": "",
//     "total": 369,
//     "rank": 246,
//     "total_percentage": "61.50"
//   },
//   {
//     "name": "فاطمة أيمن أمين دمرداش عبدالقوى",
//     "id": 20113,
//     "degrees": [
//       "80",
//       "59",
//       "88",
//       "61",
//       "49",
//       "56",
//       "55"
//     ],
//     "total_grade": "",
//     "total": 368,
//     "rank": 247,
//     "total_percentage": "61.33"
//   },
//   {
//     "name": "ندى صابر السيد أبوسريع قطب",
//     "id": 25086,
//     "degrees": [
//       "86",
//       "52",
//       "69",
//       "71",
//       "57",
//       "67",
//       "51"
//     ],
//     "total_grade": "",
//     "total": 367,
//     "rank": 248,
//     "total_percentage": "61.17"
//   },
//   {
//     "name": "سلسبيل سامح عبدالحميد داود",
//     "id": 25040,
//     "degrees": [
//       "66",
//       "54",
//       "80",
//       "89",
//       "32",
//       "71",
//       "40"
//     ],
//     "total_grade": "",
//     "total": 366,
//     "rank": 249,
//     "total_percentage": "61.00"
//   },
//   {
//     "name": "أمينة كمال صلاح شلقاني",
//     "id": 20029,
//     "degrees": [
//       "62",
//       "60",
//       "54",
//       "73",
//       "64",
//       "63",
//       "51"
//     ],
//     "total_grade": "",
//     "total": 365,
//     "rank": 250,
//     "total_percentage": "60.83"
//   },
//   {
//     "name": "آمنة حامد فاروق أحمد",
//     "id": 25201,
//     "degrees": [
//       "74",
//       "38",
//       "79",
//       "67",
//       "54",
//       "58",
//       "67"
//     ],
//     "total_grade": "",
//     "total": 363,
//     "rank": 251,
//     "total_percentage": "60.50"
//   },
//   {
//     "name": "آية نصر شحات فرحات مرداش",
//     "id": 25003,
//     "degrees": [
//       "78",
//       "39",
//       "83",
//       "70",
//       "71",
//       "63",
//       "36"
//     ],
//     "total_grade": "",
//     "total": 362,
//     "rank": 252,
//     "total_percentage": "60.33"
//   },
//   {
//     "name": "عائشة فتحى عبداللطيف عبدالحكيم",
//     "id": 25053,
//     "degrees": [
//       "76",
//       "56",
//       "59",
//       "94",
//       "43",
//       "67",
//       "43"
//     ],
//     "total_grade": "",
//     "total": 362,
//     "rank": 253,
//     "total_percentage": "60.33"
//   },
//   {
//     "name": "يوسف خالد أحمد إسماعيل أحمد",
//     "id": 20565,
//     "degrees": [
//       "66",
//       "60",
//       "/64",
//       "/64",
//       "54",
//       "60",
//       "59"
//     ],
//     "total_grade": "",
//     "total": 361,
//     "rank": 254,
//     "total_percentage": "60.17"
//   },
//   {
//     "name": "عبدالرحمن مشعل خلف خالد مسفر المسفر",
//     "id": 20104,
//     "degrees": [
//       "80",
//       "48",
//       "77",
//       "73",
//       "50",
//       "58",
//       "54"
//     ],
//     "total_grade": "",
//     "total": 360,
//     "rank": 255,
//     "total_percentage": "60.00"
//   },
//   {
//     "name": "رحمة محمد عواد أحمد السيسي",
//     "id": 25031,
//     "degrees": [
//       "58",
//       "42",
//       "54",
//       "88",
//       "50",
//       "65",
//       "61"
//     ],
//     "total_grade": "",
//     "total": 360,
//     "rank": 256,
//     "total_percentage": "60.00"
//   },
//   {
//     "name": "ندى راضي عبدالله خليفة",
//     "id": 25084,
//     "degrees": [
//       "60",
//       "37",
//       "67",
//       "80",
//       "59",
//       "59",
//       "58"
//     ],
//     "total_grade": "",
//     "total": 360,
//     "rank": 257,
//     "total_percentage": "60.00"
//   },
//   {
//     "name": "دينا أحمد عدلي عبدالحليم محمد",
//     "id": 20051,
//     "degrees": [
//       "74",
//       "47",
//       "65",
//       "65",
//       "54",
//       "72",
//       "56"
//     ],
//     "total_grade": "",
//     "total": 359,
//     "rank": 258,
//     "total_percentage": "59.83"
//   },
//   {
//     "name": "إسراء عوض عبدالعزيز عوض",
//     "id": 25010,
//     "degrees": [
//       "82",
//       "53",
//       "74",
//       "74",
//       "53",
//       "58",
//       "46"
//     ],
//     "total_grade": "",
//     "total": 358,
//     "rank": 259,
//     "total_percentage": "59.67"
//   },
//   {
//     "name": "هدى أشرف لطفي محمد",
//     "id": 25094,
//     "degrees": [
//       "74",
//       "53",
//       "59",
//       "78",
//       "49",
//       "69",
//       "50"
//     ],
//     "total_grade": "",
//     "total": 358,
//     "rank": 260,
//     "total_percentage": "59.67"
//   },
//   {
//     "name": "تائب أحمد فاروق محمد",
//     "id": 20038,
//     "degrees": [
//       "78",
//       "66",
//       "61",
//       "69",
//       "49",
//       "62",
//       "50"
//     ],
//     "total_grade": "",
//     "total": 357,
//     "rank": 261,
//     "total_percentage": "59.50"
//   },
//   {
//     "name": "نابيد أحمد ليمون",
//     "id": 20164,
//     "degrees": [
//       "70",
//       "54",
//       "91",
//       "74",
//       "42",
//       "53",
//       "43"
//     ],
//     "total_grade": "",
//     "total": 357,
//     "rank": 262,
//     "total_percentage": "59.50"
//   },
//   {
//     "name": "عبدالجبار عبدالوهاب أحمد فراج",
//     "id": 20674,
//     "degrees": [
//       "82",
//       "65",
//       "62",
//       "51",
//       "60",
//       "69",
//       "50"
//     ],
//     "total_grade": "",
//     "total": 357,
//     "rank": 263,
//     "total_percentage": "59.50"
//   },
//   {
//     "name": "مريم محمد محمدين ولي",
//     "id": 25076,
//     "degrees": [
//       "82",
//       "55",
//       "61",
//       "65",
//       "46",
//       "67",
//       "63"
//     ],
//     "total_grade": "",
//     "total": 357,
//     "rank": 264,
//     "total_percentage": "59.50"
//   },
//   {
//     "name": "سارة رضا سليمان عبدالمجيد",
//     "id": 25218,
//     "degrees": [
//       "84",
//       "44",
//       "37",
//       "90",
//       "59",
//       "65",
//       "62"
//     ],
//     "total_grade": "",
//     "total": 357,
//     "rank": 265,
//     "total_percentage": "59.50"
//   },
//   {
//     "name": "مى قطب عبدالنبى جوده",
//     "id": 20447,
//     "degrees": [
//       "72",
//       "51",
//       "74",
//       "64",
//       "55",
//       "66",
//       "46"
//     ],
//     "total_grade": "",
//     "total": 356,
//     "rank": 266,
//     "total_percentage": "59.33"
//   },
//   {
//     "name": "محمود أشرف سلامة محمد",
//     "id": 25069,
//     "degrees": [
//       "78",
//       "72",
//       "46",
//       "93",
//       "42",
//       "51",
//       "52"
//     ],
//     "total_grade": "",
//     "total": 356,
//     "rank": 267,
//     "total_percentage": "59.33"
//   },
//   {
//     "name": "سهيلة وليد حسين عاطف حسن",
//     "id": 25220,
//     "degrees": [
//       "72",
//       "52",
//       "59",
//       "81",
//       "45",
//       "53",
//       "66"
//     ],
//     "total_grade": "",
//     "total": 356,
//     "rank": 268,
//     "total_percentage": "59.33"
//   },
//   {
//     "name": "مروة طه محمود محمد",
//     "id": 20444,
//     "degrees": [
//       "70",
//       "65",
//       "46",
//       "66",
//       "58",
//       "66",
//       "54"
//     ],
//     "total_grade": "",
//     "total": 355,
//     "rank": 269,
//     "total_percentage": "59.17"
//   },
//   {
//     "name": "زياد حسن محمد أحمد",
//     "id": 25217,
//     "degrees": [
//       "30",
//       "68",
//       "54",
//       "64",
//       "58",
//       "36",
//       "75"
//     ],
//     "total_grade": "",
//     "total": 355,
//     "rank": 270,
//     "total_percentage": "59.17"
//   },
//   {
//     "name": "أحمد محمد فتحي علي محمد خالد",
//     "id": 25449,
//     "degrees": [
//       "58",
//       "/64",
//       "48",
//       "/64",
//       "58",
//       "/64",
//       "57"
//     ],
//     "total_grade": "",
//     "total": 355,
//     "rank": 271,
//     "total_percentage": "59.17"
//   },
//   {
//     "name": "رانيا محمود فوزى قاسم",
//     "id": 20556,
//     "degrees": [
//       "60",
//       "47",
//       "55",
//       "/64",
//       "/64",
//       "57",
//       "/64"
//     ],
//     "total_grade": "",
//     "total": 351,
//     "rank": 272,
//     "total_percentage": "58.50"
//   },
//   {
//     "name": "جهاد محمود عمران فتح الباب",
//     "id": 20666,
//     "degrees": [
//       "54",
//       "44",
//       "77",
//       "55",
//       "53",
//       "66",
//       "55"
//     ],
//     "total_grade": "",
//     "total": 350,
//     "rank": 273,
//     "total_percentage": "58.33"
//   },
//   {
//     "name": "آيات مصطفى عبدالمقصود محمد على قاسم",
//     "id": 25002,
//     "degrees": [
//       "82",
//       "39",
//       "63",
//       "85",
//       "49",
//       "71",
//       "43"
//     ],
//     "total_grade": "",
//     "total": 350,
//     "rank": 274,
//     "total_percentage": "58.33"
//   },
//   {
//     "name": "الحسن محمود شعبان محمود مرسي",
//     "id": 25015,
//     "degrees": [
//       "86",
//       "51",
//       "76",
//       "79",
//       "59",
//       "54",
//       "31"
//     ],
//     "total_grade": "",
//     "total": 350,
//     "rank": 275,
//     "total_percentage": "58.33"
//   },
//   {
//     "name": "ردينة أحمد عبدالخالق أحمد دعيس",
//     "id": 25033,
//     "degrees": [
//       "58",
//       "42",
//       "72",
//       "76",
//       "52",
//       "56",
//       "52"
//     ],
//     "total_grade": "",
//     "total": 350,
//     "rank": 276,
//     "total_percentage": "58.33"
//   },
//   {
//     "name": "فاطمة محمود إبراهيم أحمد بدوى",
//     "id": 25061,
//     "degrees": [
//       "66",
//       "57",
//       "58",
//       "70",
//       "44",
//       "68",
//       "53"
//     ],
//     "total_grade": "",
//     "total": 350,
//     "rank": 277,
//     "total_percentage": "58.33"
//   },
//   {
//     "name": "دينا أشرف محمد توفيق سالم الاسكندرانى",
//     "id": 20052,
//     "degrees": [
//       "78",
//       "43",
//       "61",
//       "59",
//       "56",
//       "63",
//       "67"
//     ],
//     "total_grade": "",
//     "total": 349,
//     "rank": 278,
//     "total_percentage": "58.17"
//   },
//   {
//     "name": "تسنيم علاء محمود أبوالدهب",
//     "id": 25020,
//     "degrees": [
//       "80",
//       "41",
//       "68",
//       "85",
//       "32",
//       "79",
//       "44"
//     ],
//     "total_grade": "",
//     "total": 349,
//     "rank": 279,
//     "total_percentage": "58.17"
//   },
//   {
//     "name": "شهد رزق محمد هيبه",
//     "id": 25047,
//     "degrees": [
//       "54",
//       "54",
//       "57",
//       "59",
//       "55",
//       "68",
//       "56"
//     ],
//     "total_grade": "",
//     "total": 349,
//     "rank": 280,
//     "total_percentage": "58.17"
//   },
//   {
//     "name": "عمر سيد رفاعى حسن محمد",
//     "id": 25225,
//     "degrees": [
//       "58",
//       "50",
//       "66",
//       "89",
//       "45",
//       "62",
//       "37"
//     ],
//     "total_grade": "",
//     "total": 349,
//     "rank": 281,
//     "total_percentage": "58.17"
//   },
//   {
//     "name": "بسملة حسين حمدي مهدي",
//     "id": 25018,
//     "degrees": [
//       "82",
//       "51",
//       "67",
//       "76",
//       "48",
//       "56",
//       "49"
//     ],
//     "total_grade": "",
//     "total": 347,
//     "rank": 282,
//     "total_percentage": "57.83"
//   },
//   {
//     "name": "سلمى فراج علي فراج",
//     "id": 25219,
//     "degrees": [
//       "56",
//       "67",
//       "50",
//       "77",
//       "39",
//       "55",
//       "57"
//     ],
//     "total_grade": "",
//     "total": 345,
//     "rank": 283,
//     "total_percentage": "57.50"
//   },
//   {
//     "name": "منار جمال السيد صابر",
//     "id": 20158,
//     "degrees": [
//       "80",
//       "45",
//       "70",
//       "83",
//       "52",
//       "50",
//       "44"
//     ],
//     "total_grade": "",
//     "total": 344,
//     "rank": 284,
//     "total_percentage": "57.33"
//   },
//   {
//     "name": "رجب رضا رجب محمد حسن",
//     "id": 20056,
//     "degrees": [
//       "80",
//       "50",
//       "60",
//       "71",
//       "55",
//       "59",
//       "48"
//     ],
//     "total_grade": "",
//     "total": 343,
//     "rank": 285,
//     "total_percentage": "57.17"
//   },
//   {
//     "name": "بسملة أحمد متولى حسن",
//     "id": 25017,
//     "degrees": [
//       "74",
//       "46",
//       "70",
//       "69",
//       "42",
//       "59",
//       "57"
//     ],
//     "total_grade": "",
//     "total": 343,
//     "rank": 286,
//     "total_percentage": "57.17"
//   },
//   {
//     "name": "سلمى إبراهيم فاروق عبدالحميد",
//     "id": 25041,
//     "degrees": [
//       "78",
//       "45",
//       "62",
//       "65",
//       "48",
//       "70",
//       "53"
//     ],
//     "total_grade": "",
//     "total": 343,
//     "rank": 287,
//     "total_percentage": "57.17"
//   },
//   {
//     "name": "ندى على أحمد محمد",
//     "id": 25241,
//     "degrees": [
//       "64",
//       "40",
//       "73",
//       "82",
//       "43",
//       "47",
//       "58"
//     ],
//     "total_grade": "",
//     "total": 343,
//     "rank": 288,
//     "total_percentage": "57.17"
//   },
//   {
//     "name": "عبدالرحمن محمد أحمد حسن",
//     "id": 20101,
//     "degrees": [
//       "74",
//       "57",
//       "35",
//       "85",
//       "49",
//       "67",
//       "49"
//     ],
//     "total_grade": "",
//     "total": 342,
//     "rank": 289,
//     "total_percentage": "57.00"
//   },
//   {
//     "name": "محمد على جادو ضوي",
//     "id": 25067,
//     "degrees": [
//       "74",
//       "44",
//       "67",
//       "77",
//       "51",
//       "58",
//       "45"
//     ],
//     "total_grade": "",
//     "total": 342,
//     "rank": 290,
//     "total_percentage": "57.00"
//   },
//   {
//     "name": "روان سامح سيد إبراهيم",
//     "id": 25036,
//     "degrees": [
//       "56",
//       "41",
//       "54",
//       "74",
//       "48",
//       "78",
//       "46"
//     ],
//     "total_grade": "",
//     "total": 341,
//     "rank": 291,
//     "total_percentage": "56.83"
//   },
//   {
//     "name": "عز الدين أشرف محمد شعبان",
//     "id": 20557,
//     "degrees": [
//       "74",
//       "60",
//       "35",
//       "60",
//       "64",
//       "61",
//       "60"
//     ],
//     "total_grade": "",
//     "total": 340,
//     "rank": 292,
//     "total_percentage": "56.67"
//   },
//   {
//     "name": "تسنيم محمد خليل الطوخى",
//     "id": 25021,
//     "degrees": [
//       "70",
//       "51",
//       "57",
//       "77",
//       "42",
//       "62",
//       "51"
//     ],
//     "total_grade": "",
//     "total": 340,
//     "rank": 293,
//     "total_percentage": "56.67"
//   },
//   {
//     "name": "أحمد مصطفى محمد محمد",
//     "id": 25450,
//     "degrees": [
//       "72",
//       "53",
//       "/64",
//       "/64",
//       "53",
//       "53",
//       "53"
//     ],
//     "total_grade": "",
//     "total": 340,
//     "rank": 294,
//     "total_percentage": "56.67"
//   },
//   {
//     "name": "زياد عماد سيد محمد أحمد",
//     "id": 20073,
//     "degrees": [
//       "78",
//       "45",
//       "62",
//       "83",
//       "43",
//       "51",
//       "55"
//     ],
//     "total_grade": "",
//     "total": 339,
//     "rank": 295,
//     "total_percentage": "56.50"
//   },
//   {
//     "name": "محمد أكرم الإسلام",
//     "id": 20128,
//     "degrees": [
//       "54",
//       "27",
//       "73",
//       "74",
//       "47",
//       "55",
//       "62"
//     ],
//     "total_grade": "",
//     "total": 338,
//     "rank": 296,
//     "total_percentage": "56.33"
//   },
//   {
//     "name": "محمد محمد شوقي عبدالسميع",
//     "id": 20442,
//     "degrees": [
//       "80",
//       "58",
//       "49",
//       "94",
//       "37",
//       "72",
//       "28"
//     ],
//     "total_grade": "",
//     "total": 338,
//     "rank": 297,
//     "total_percentage": "56.33"
//   },
//   {
//     "name": "منةالله رضا إسماعيل عبدالحى",
//     "id": 25079,
//     "degrees": [
//       "74",
//       "56",
//       "55",
//       "81",
//       "45",
//       "66",
//       "35"
//     ],
//     "total_grade": "",
//     "total": 338,
//     "rank": 298,
//     "total_percentage": "56.33"
//   },
//   {
//     "name": "منةالله طارق حسين محمد",
//     "id": 25568,
//     "degrees": [
//       "82",
//       "34",
//       "62",
//       "34",
//       "65",
//       "80",
//       "62"
//     ],
//     "total_grade": "",
//     "total": 337,
//     "rank": 299,
//     "total_percentage": "56.17"
//   },
//   {
//     "name": "رضوى حماد علي عبدالله على",
//     "id": 25034,
//     "degrees": [
//       "66",
//       "49",
//       "64",
//       "62",
//       "48",
//       "57",
//       "56"
//     ],
//     "total_grade": "",
//     "total": 336,
//     "rank": 300,
//     "total_percentage": "56.00"
//   },
//   {
//     "name": "شهد محمد على محمد",
//     "id": 25050,
//     "degrees": [
//       "78",
//       "49",
//       "68",
//       "72",
//       "51",
//       "52",
//       "44"
//     ],
//     "total_grade": "",
//     "total": 336,
//     "rank": 301,
//     "total_percentage": "56.00"
//   },
//   {
//     "name": "محمد جمال السيد علي الغول",
//     "id": 20129,
//     "degrees": [
//       "72",
//       "37",
//       "65",
//       "75",
//       "55",
//       "53",
//       "49"
//     ],
//     "total_grade": "",
//     "total": 334,
//     "rank": 302,
//     "total_percentage": "55.67"
//   },
//   {
//     "name": "عايدة علي محمد علي",
//     "id": 25054,
//     "degrees": [
//       "68",
//       "34",
//       "57",
//       "67",
//       "60",
//       "58",
//       "58"
//     ],
//     "total_grade": "",
//     "total": 334,
//     "rank": 303,
//     "total_percentage": "55.67"
//   },
//   {
//     "name": "سلسبيل يوسف يوسف محمود النجار",
//     "id": 20082,
//     "degrees": [
//       "72",
//       "49",
//       "44",
//       "54",
//       "68",
//       "59",
//       "59"
//     ],
//     "total_grade": "",
//     "total": 333,
//     "rank": 304,
//     "total_percentage": "55.50"
//   },
//   {
//     "name": "مصطفى كامل عبدالخالق سيد أحمد",
//     "id": 25460,
//     "degrees": [
//       "/64",
//       "59",
//       "27",
//       "/64",
//       "55",
//       "/64",
//       "/64"
//     ],
//     "total_grade": "",
//     "total": 333,
//     "rank": 305,
//     "total_percentage": "55.50"
//   },
//   {
//     "name": "محمود سعيد بيومى علي حميد",
//     "id": 25071,
//     "degrees": [
//       "64",
//       "60",
//       "42",
//       "70",
//       "40",
//       "63",
//       "57"
//     ],
//     "total_grade": "",
//     "total": 332,
//     "rank": 306,
//     "total_percentage": "55.33"
//   },
//   {
//     "name": "علياء محمد عبدالغنى سلامة",
//     "id": 25456,
//     "degrees": [
//       "56",
//       "62",
//       "/64",
//       "/64",
//       "34",
//       "65",
//       "43"
//     ],
//     "total_grade": "",
//     "total": 332,
//     "rank": 307,
//     "total_percentage": "55.33"
//   },
//   {
//     "name": "نورهان سيد عبدالحكيم دياب",
//     "id": 25243,
//     "degrees": [
//       "70",
//       "63",
//       "42",
//       "64",
//       "50",
//       "64",
//       "47"
//     ],
//     "total_grade": "",
//     "total": 330,
//     "rank": 308,
//     "total_percentage": "55.00"
//   },
//   {
//     "name": "شهد إسماعيل أحمد شحاتة",
//     "id": 25045,
//     "degrees": [
//       "66",
//       "47",
//       "57",
//       "64",
//       "35",
//       "64",
//       "62"
//     ],
//     "total_grade": "",
//     "total": 329,
//     "rank": 309,
//     "total_percentage": "54.83"
//   },
//   {
//     "name": "ملك رضوان إبراهيم محمد التهامى",
//     "id": 25077,
//     "degrees": [
//       "70",
//       "42",
//       "45",
//       "73",
//       "56",
//       "68",
//       "45"
//     ],
//     "total_grade": "",
//     "total": 329,
//     "rank": 310,
//     "total_percentage": "54.83"
//   },
//   {
//     "name": "يونس السيد يونس محمد سليم",
//     "id": 20453,
//     "degrees": [
//       "70",
//       "52",
//       "57",
//       "66",
//       "39",
//       "63",
//       "50"
//     ],
//     "total_grade": "",
//     "total": 327,
//     "rank": 311,
//     "total_percentage": "54.50"
//   },
//   {
//     "name": "دعاء إبراهيم عشماوى أبوزيد",
//     "id": 25029,
//     "degrees": [
//       "86",
//       "47",
//       "63",
//       "53",
//       "50",
//       "60",
//       "54"
//     ],
//     "total_grade": "",
//     "total": 327,
//     "rank": 312,
//     "total_percentage": "54.50"
//   },
//   {
//     "name": "محمود محمد سيد مصطفى",
//     "id": 20141,
//     "degrees": [
//       "74",
//       "إلغاء",
//       "66",
//       "63",
//       "66",
//       "59",
//       "72"
//     ],
//     "total_grade": "",
//     "total": 326,
//     "rank": 313,
//     "total_percentage": "54.33"
//   },
//   {
//     "name": "مصطفى ياسر محمد عطيه عنانى الجبالى",
//     "id": 20563,
//     "degrees": [
//       "60",
//       "39",
//       "54",
//       "/64",
//       "60",
//       "58",
//       "51"
//     ],
//     "total_grade": "",
//     "total": 326,
//     "rank": 314,
//     "total_percentage": "54.33"
//   },
//   {
//     "name": "جنى امجد أحمد إسماعيل على",
//     "id": 25022,
//     "degrees": [
//       "80",
//       "46",
//       "70",
//       "77",
//       "41",
//       "64",
//       "27"
//     ],
//     "total_grade": "",
//     "total": 325,
//     "rank": 315,
//     "total_percentage": "54.17"
//   },
//   {
//     "name": "مصطفى أبوالمعاطى هلال عبدالعظيم",
//     "id": 25567,
//     "degrees": [
//       "54",
//       "46",
//       "64",
//       "54",
//       "56",
//       "50",
//       "53"
//     ],
//     "total_grade": "",
//     "total": 323,
//     "rank": 316,
//     "total_percentage": "53.83"
//   },
//   {
//     "name": "عمر محمد أحمد عبدالرحمن حشيش",
//     "id": 20675,
//     "degrees": [
//       "88",
//       "51",
//       "51",
//       "54",
//       "57",
//       "55",
//       "53"
//     ],
//     "total_grade": "",
//     "total": 321,
//     "rank": 317,
//     "total_percentage": "53.50"
//   },
//   {
//     "name": "حسن نبيل حسن سيد محمود",
//     "id": 25214,
//     "degrees": [
//       "64",
//       "58",
//       "31",
//       "73",
//       "52",
//       "56",
//       "51"
//     ],
//     "total_grade": "",
//     "total": 321,
//     "rank": 318,
//     "total_percentage": "53.50"
//   },
//   {
//     "name": "هدير عصام حسن محمد حسن",
//     "id": 25096,
//     "degrees": [
//       "54",
//       "63",
//       "39",
//       "66",
//       "49",
//       "50",
//       "52"
//     ],
//     "total_grade": "",
//     "total": 319,
//     "rank": 319,
//     "total_percentage": "53.17"
//   },
//   {
//     "name": "ملك محمود محمد محمود ابراهيم",
//     "id": 20157,
//     "degrees": [
//       "88",
//       "42",
//       "57",
//       "58",
//       "37",
//       "75",
//       "48"
//     ],
//     "total_grade": "",
//     "total": 317,
//     "rank": 320,
//     "total_percentage": "52.83"
//   },
//   {
//     "name": "مريم محمد فاروق إبراهيم محمد سالم",
//     "id": 25075,
//     "degrees": [
//       "70",
//       "52",
//       "79",
//       "47",
//       "28",
//       "66",
//       "45"
//     ],
//     "total_grade": "",
//     "total": 317,
//     "rank": 321,
//     "total_percentage": "52.83"
//   },
//   {
//     "name": "محمود بيومي محمد سليم",
//     "id": 20137,
//     "degrees": [
//       "74",
//       "50",
//       "36",
//       "48",
//       "71",
//       "47",
//       "63"
//     ],
//     "total_grade": "",
//     "total": 315,
//     "rank": 322,
//     "total_percentage": "52.50"
//   },
//   {
//     "name": "حنان علاء محمود احمد",
//     "id": 25452,
//     "degrees": [
//       "74",
//       "50",
//       "60",
//       "53",
//       "50",
//       "57",
//       "45"
//     ],
//     "total_grade": "",
//     "total": 315,
//     "rank": 323,
//     "total_percentage": "52.50"
//   },
//   {
//     "name": "إسراء أحمد سعيد إبراهيم فضل",
//     "id": 25008,
//     "degrees": [
//       "86",
//       "45",
//       "72",
//       "56",
//       "42",
//       "69",
//       "30"
//     ],
//     "total_grade": "",
//     "total": 314,
//     "rank": 324,
//     "total_percentage": "52.33"
//   },
//   {
//     "name": "بسملة محمد أبوشعبة على محمد",
//     "id": 25213,
//     "degrees": [
//       "62",
//       "45",
//       "56",
//       "60",
//       "58",
//       "48",
//       "47"
//     ],
//     "total_grade": "",
//     "total": 314,
//     "rank": 325,
//     "total_percentage": "52.33"
//   },
//   {
//     "name": "ندى عماد الدين محمد عويس",
//     "id": 25087,
//     "degrees": [
//       "66",
//       "51",
//       "64",
//       "64",
//       "40",
//       "53",
//       "41"
//     ],
//     "total_grade": "",
//     "total": 313,
//     "rank": 326,
//     "total_percentage": "52.17"
//   },
//   {
//     "name": "رحمة محمود محمد أحمد محمد شراب",
//     "id": 20060,
//     "degrees": [
//       "58",
//       "46",
//       "72",
//       "51",
//       "37",
//       "60",
//       "46"
//     ],
//     "total_grade": "",
//     "total": 312,
//     "rank": 327,
//     "total_percentage": "52.00"
//   },
//   {
//     "name": "سماح جمال إسماعيل يونس",
//     "id": 20673,
//     "degrees": [
//       "60",
//       "57",
//       "51",
//       "54",
//       "55",
//       "54",
//       "41"
//     ],
//     "total_grade": "",
//     "total": 312,
//     "rank": 328,
//     "total_percentage": "52.00"
//   },
//   {
//     "name": "مصطفى محمد عبدالرسول عبدالشافي",
//     "id": 20316,
//     "degrees": [
//       "62",
//       "28",
//       "62",
//       "67",
//       "37",
//       "67",
//       "50"
//     ],
//     "total_grade": "",
//     "total": 311,
//     "rank": 329,
//     "total_percentage": "51.83"
//   },
//   {
//     "name": "أحمد فؤاد شكرى مدكور رفاعى",
//     "id": 25004,
//     "degrees": [
//       "72",
//       "50",
//       "63",
//       "59",
//       "34",
//       "66",
//       "38"
//     ],
//     "total_grade": "",
//     "total": 310,
//     "rank": 330,
//     "total_percentage": "51.67"
//   },
//   {
//     "name": "رحمة عمرو محمد زكريا حسين",
//     "id": 25030,
//     "degrees": [
//       "44",
//       "37",
//       "62",
//       "76",
//       "38",
//       "51",
//       "46"
//     ],
//     "total_grade": "",
//     "total": 310,
//     "rank": 331,
//     "total_percentage": "51.67"
//   },
//   {
//     "name": "شيماء على فولى خليل",
//     "id": 25454,
//     "degrees": [
//       "52",
//       "53",
//       "64",
//       "64",
//       "33",
//       "51",
//       "44"
//     ],
//     "total_grade": "",
//     "total": 309,
//     "rank": 332,
//     "total_percentage": "51.50"
//   },
//   {
//     "name": "جهاد منتصر عبدالسميع ضيف مسعود",
//     "id": 20041,
//     "degrees": [
//       "72",
//       "54",
//       "16",
//       "70",
//       "58",
//       "67",
//       "43"
//     ],
//     "total_grade": "",
//     "total": 308,
//     "rank": 333,
//     "total_percentage": "51.33"
//   },
//   {
//     "name": "منار أيمن خميس شعبان خليل",
//     "id": 25236,
//     "degrees": [
//       "68",
//       "42",
//       "39",
//       "73",
//       "45",
//       "70",
//       "39"
//     ],
//     "total_grade": "",
//     "total": 308,
//     "rank": 334,
//     "total_percentage": "51.33"
//   },
//   {
//     "name": "نادية محمد عبدالعدل السيد",
//     "id": 25083,
//     "degrees": [
//       "58",
//       "50",
//       "57",
//       "64",
//       "42",
//       "59",
//       "35"
//     ],
//     "total_grade": "",
//     "total": 307,
//     "rank": 335,
//     "total_percentage": "51.17"
//   },
//   {
//     "name": "أحمد سامح عبدالجواد عبدالله",
//     "id": 25204,
//     "degrees": [
//       "78",
//       "34",
//       "67",
//       "69",
//       "42",
//       "51",
//       "44"
//     ],
//     "total_grade": "",
//     "total": 307,
//     "rank": 336,
//     "total_percentage": "51.17"
//   },
//   {
//     "name": "محمود أشرف كامل الليثى سعدالدين",
//     "id": 25070,
//     "degrees": [
//       "62",
//       "42",
//       "65",
//       "64",
//       "50",
//       "45",
//       "39"
//     ],
//     "total_grade": "",
//     "total": 305,
//     "rank": 337,
//     "total_percentage": "50.83"
//   },
//   {
//     "name": "يوسف ممدوح عاطف خلاف",
//     "id": 25101,
//     "degrees": [
//       "74",
//       "54",
//       "49",
//       "79",
//       "36",
//       "55",
//       "32"
//     ],
//     "total_grade": "",
//     "total": 305,
//     "rank": 338,
//     "total_percentage": "50.83"
//   },
//   {
//     "name": "عبدالله أحمد محمد جوده",
//     "id": 20438,
//     "degrees": [
//       "68",
//       "41",
//       "58",
//       "57",
//       "37",
//       "65",
//       "45"
//     ],
//     "total_grade": "",
//     "total": 303,
//     "rank": 339,
//     "total_percentage": "50.50"
//   },
//   {
//     "name": "آية محمد أحمد حسن محمد",
//     "id": 25203,
//     "degrees": [
//       "64",
//       "62",
//       "36",
//       "70",
//       "37",
//       "51",
//       "46"
//     ],
//     "total_grade": "",
//     "total": 302,
//     "rank": 340,
//     "total_percentage": "50.33"
//   },
//   {
//     "name": "أحمد ناصر مضحى سفاح الطفيرى",
//     "id": 20016,
//     "degrees": [
//       "78",
//       "37",
//       "58",
//       "68",
//       "51",
//       "56",
//       "31"
//     ],
//     "total_grade": "",
//     "total": 301,
//     "rank": 341,
//     "total_percentage": "50.17"
//   },
//   {
//     "name": "رامى حمد سالم العشوش",
//     "id": 20669,
//     "degrees": [
//       "68",
//       "47",
//       "58",
//       "51",
//       "41",
//       "/64",
//       "40"
//     ],
//     "total_grade": "",
//     "total": 301,
//     "rank": 342,
//     "total_percentage": "50.17"
//   },
//   {
//     "name": "يوسف طارق مصطفى عبدالهادى مصطفى",
//     "id": 25248,
//     "degrees": [
//       "78",
//       "42",
//       "45",
//       "73",
//       "30",
//       "49",
//       "61"
//     ],
//     "total_grade": "",
//     "total": 300,
//     "rank": 343,
//     "total_percentage": "50.00"
//   },
//   {
//     "name": "أسماء عبدالقادر كلاب",
//     "id": 25451,
//     "degrees": [
//       "54",
//       "57",
//       "63",
//       "/64",
//       "52",
//       "غـ",
//       "/64"
//     ],
//     "total_grade": "",
//     "total": 300,
//     "rank": 344,
//     "total_percentage": "50.00"
//   },
//   {
//     "name": "منةالله محمد عبدالمحسن محمد عبدالعزيز",
//     "id": 20680,
//     "degrees": [
//       "62",
//       "49",
//       "/64",
//       "45",
//       "44",
//       "52",
//       "45"
//     ],
//     "total_grade": "",
//     "total": 299,
//     "rank": 345,
//     "total_percentage": "49.83"
//   },
//   {
//     "name": "محمود يوسف كمال الدين أحمد السرساوى",
//     "id": 25072,
//     "degrees": [
//       "72",
//       "42",
//       "46",
//       "73",
//       "45",
//       "47",
//       "45"
//     ],
//     "total_grade": "",
//     "total": 298,
//     "rank": 346,
//     "total_percentage": "49.67"
//   },
//   {
//     "name": "إسراء محمد محمود عبدالحليم",
//     "id": 25206,
//     "degrees": [
//       "52",
//       "38",
//       "52",
//       "48",
//       "40",
//       "68",
//       "49"
//     ],
//     "total_grade": "",
//     "total": 295,
//     "rank": 347,
//     "total_percentage": "49.17"
//   },
//   {
//     "name": "مي محمد حسين شحاتة حسين",
//     "id": 25082,
//     "degrees": [
//       "68",
//       "28",
//       "30",
//       "83",
//       "36",
//       "73",
//       "44"
//     ],
//     "total_grade": "",
//     "total": 294,
//     "rank": 348,
//     "total_percentage": "49.00"
//   },
//   {
//     "name": "ندى شوقى حسانين عبدالحافظ",
//     "id": 25085,
//     "degrees": [
//       "60",
//       "51",
//       "46",
//       "57",
//       "35",
//       "57",
//       "48"
//     ],
//     "total_grade": "",
//     "total": 294,
//     "rank": 349,
//     "total_percentage": "49.00"
//   },
//   {
//     "name": "أحمد محمد فاروق أحمد حسانين",
//     "id": 25006,
//     "degrees": [
//       "68",
//       "39",
//       "37",
//       "59",
//       "52",
//       "57",
//       "49"
//     ],
//     "total_grade": "",
//     "total": 293,
//     "rank": 350,
//     "total_percentage": "48.83"
//   },
//   {
//     "name": "جهاد عماد محمد عليان",
//     "id": 25023,
//     "degrees": [
//       "62",
//       "32",
//       "44",
//       "72",
//       "32",
//       "55",
//       "58"
//     ],
//     "total_grade": "",
//     "total": 293,
//     "rank": 351,
//     "total_percentage": "48.83"
//   },
//   {
//     "name": "نورهان محمد إسماعيل محمد عبدالجواد",
//     "id": 25091,
//     "degrees": [
//       "70",
//       "55",
//       "39",
//       "69",
//       "32",
//       "58",
//       "40"
//     ],
//     "total_grade": "",
//     "total": 293,
//     "rank": 352,
//     "total_percentage": "48.83"
//   },
//   {
//     "name": "مسعد عبدالعال عبدالرحمن عبدالعال",
//     "id": 20315,
//     "degrees": [
//       "66",
//       "54",
//       "22",
//       "68",
//       "48",
//       "70",
//       "30"
//     ],
//     "total_grade": "",
//     "total": 292,
//     "rank": 353,
//     "total_percentage": "48.67"
//   },
//   {
//     "name": "سعيد السيد على محمد",
//     "id": 20672,
//     "degrees": [
//       "80",
//       "56",
//       "46",
//       "53",
//       "50",
//       "51",
//       "36"
//     ],
//     "total_grade": "",
//     "total": 292,
//     "rank": 354,
//     "total_percentage": "48.67"
//   },
//   {
//     "name": "ريهام سوهاي حسين أبوداغر",
//     "id": 25038,
//     "degrees": [
//       "66",
//       "47",
//       "37",
//       "71",
//       "31",
//       "62",
//       "43"
//     ],
//     "total_grade": "",
//     "total": 291,
//     "rank": 355,
//     "total_percentage": "48.50"
//   },
//   {
//     "name": "يوسف أحمد محمود محمد السيد",
//     "id": 25247,
//     "degrees": [
//       "54",
//       "41",
//       "44",
//       "76",
//       "46",
//       "48",
//       "36"
//     ],
//     "total_grade": "",
//     "total": 291,
//     "rank": 356,
//     "total_percentage": "48.50"
//   },
//   {
//     "name": "سفيان محمد مصطفى خليل محمد خليل",
//     "id": 20299,
//     "degrees": [
//       "54",
//       "39",
//       "52",
//       "45",
//       "45",
//       "75",
//       "34"
//     ],
//     "total_grade": "",
//     "total": 290,
//     "rank": 357,
//     "total_percentage": "48.33"
//   },
//   {
//     "name": "هاجر حامد حسين حامد",
//     "id": 20681,
//     "degrees": [
//       "60",
//       "25",
//       "46",
//       "48",
//       "66",
//       "52",
//       "50"
//     ],
//     "total_grade": "",
//     "total": 287,
//     "rank": 358,
//     "total_percentage": "47.83"
//   },
//   {
//     "name": "رودينة مصطفى سمير فهمى",
//     "id": 25037,
//     "degrees": [
//       "66",
//       "31",
//       "53",
//       "57",
//       "39",
//       "57",
//       "49"
//     ],
//     "total_grade": "",
//     "total": 286,
//     "rank": 359,
//     "total_percentage": "47.67"
//   },
//   {
//     "name": "شهد عادل عباس محمد سلامة",
//     "id": 25048,
//     "degrees": [
//       "74",
//       "24",
//       "38",
//       "70",
//       "50",
//       "55",
//       "49"
//     ],
//     "total_grade": "",
//     "total": 286,
//     "rank": 360,
//     "total_percentage": "47.67"
//   },
//   {
//     "name": "محمد عادل عبدالحفيظ حسنين",
//     "id": 25229,
//     "degrees": [
//       "62",
//       "43",
//       "30",
//       "47",
//       "44",
//       "61",
//       "61"
//     ],
//     "total_grade": "",
//     "total": 286,
//     "rank": 361,
//     "total_percentage": "47.67"
//   },
//   {
//     "name": "محمد أحمد محمد أحمد دسوقى",
//     "id": 25064,
//     "degrees": [
//       "78",
//       "44",
//       "40",
//       "70",
//       "39",
//       "60",
//       "32"
//     ],
//     "total_grade": "",
//     "total": 285,
//     "rank": 362,
//     "total_percentage": "47.50"
//   },
//   {
//     "name": "فاطمة أنور سيد أحمد",
//     "id": 25226,
//     "degrees": [
//       "70",
//       "53",
//       "25",
//       "57",
//       "32",
//       "65",
//       "53"
//     ],
//     "total_grade": "",
//     "total": 285,
//     "rank": 363,
//     "total_percentage": "47.50"
//   },
//   {
//     "name": "ملك حمدى قاسم درويش محمد النوبى",
//     "id": 20679,
//     "degrees": [
//       "64",
//       "36",
//       "50",
//       "45",
//       "46",
//       "57",
//       "50"
//     ],
//     "total_grade": "",
//     "total": 284,
//     "rank": 364,
//     "total_percentage": "47.33"
//   },
//   {
//     "name": "سومية محمد عبدالعاطى إبراهيم",
//     "id": 25044,
//     "degrees": [
//       "70",
//       "42",
//       "47",
//       "58",
//       "62",
//       "34",
//       "41"
//     ],
//     "total_grade": "",
//     "total": 284,
//     "rank": 365,
//     "total_percentage": "47.33"
//   },
//   {
//     "name": "فاطمة محمد علي سعيد",
//     "id": 25060,
//     "degrees": [
//       "52",
//       "37",
//       "51",
//       "52",
//       "42",
//       "54",
//       "47"
//     ],
//     "total_grade": "",
//     "total": 283,
//     "rank": 366,
//     "total_percentage": "47.17"
//   },
//   {
//     "name": "فاطمة ناصر خليل محمد عويضة",
//     "id": 25062,
//     "degrees": [
//       "50",
//       "43",
//       "37",
//       "82",
//       "39",
//       "46",
//       "36"
//     ],
//     "total_grade": "",
//     "total": 283,
//     "rank": 367,
//     "total_percentage": "47.17"
//   },
//   {
//     "name": "ملك طارق سيد حسن",
//     "id": 25235,
//     "degrees": [
//       "86",
//       "21",
//       "61",
//       "60",
//       "48",
//       "58",
//       "34"
//     ],
//     "total_grade": "",
//     "total": 282,
//     "rank": 368,
//     "total_percentage": "47.00"
//   },
//   {
//     "name": "ماجد على مونس ساكت",
//     "id": 20127,
//     "degrees": [
//       "80",
//       "67",
//       "84",
//       "68",
//       "62",
//       "إلغاء",
//       "إلغاء"
//     ],
//     "total_grade": "",
//     "total": 281,
//     "rank": 369,
//     "total_percentage": "46.83"
//   },
//   {
//     "name": "أسماء ضاحي أحمد محمود",
//     "id": 25208,
//     "degrees": [
//       "64",
//       "41",
//       "50",
//       "63",
//       "43",
//       "54",
//       "30"
//     ],
//     "total_grade": "",
//     "total": 281,
//     "rank": 370,
//     "total_percentage": "46.83"
//   },
//   {
//     "name": "محمد هشام سيد عبدالعزيز",
//     "id": 25459,
//     "degrees": [
//       "66",
//       "29",
//       "44",
//       "/64",
//       "48",
//       "59",
//       "36"
//     ],
//     "total_grade": "",
//     "total": 280,
//     "rank": 371,
//     "total_percentage": "46.67"
//   },
//   {
//     "name": "فاطمة محمد عبدالخالق أحمدإسماعيل",
//     "id": 25059,
//     "degrees": [
//       "64",
//       "38",
//       "61",
//       "51",
//       "36",
//       "47",
//       "46"
//     ],
//     "total_grade": "",
//     "total": 279,
//     "rank": 372,
//     "total_percentage": "46.50"
//   },
//   {
//     "name": "إيمان تامر على أحمد على",
//     "id": 25563,
//     "degrees": [
//       "70",
//       "42",
//       "56",
//       "52",
//       "39",
//       "51",
//       "39"
//     ],
//     "total_grade": "",
//     "total": 279,
//     "rank": 373,
//     "total_percentage": "46.50"
//   },
//   {
//     "name": "زايد محمود أحمد حماد",
//     "id": 20296,
//     "degrees": [
//       "70",
//       "32",
//       "36",
//       "92",
//       "24",
//       "51",
//       "43"
//     ],
//     "total_grade": "",
//     "total": 278,
//     "rank": 374,
//     "total_percentage": "46.33"
//   },
//   {
//     "name": "منة محمد خليل محمود",
//     "id": 25569,
//     "degrees": [
//       "70",
//       "48",
//       "43",
//       "47",
//       "43",
//       "59",
//       "38"
//     ],
//     "total_grade": "",
//     "total": 278,
//     "rank": 375,
//     "total_percentage": "46.33"
//   },
//   {
//     "name": "عمر تامر علي يونس",
//     "id": 25348,
//     "degrees": [
//       "62",
//       "43",
//       "50",
//       "64",
//       "30",
//       "53",
//       "37"
//     ],
//     "total_grade": "",
//     "total": 277,
//     "rank": 376,
//     "total_percentage": "46.17"
//   },
//   {
//     "name": "وفاء محمد شوقى مصطفى السيد",
//     "id": 20185,
//     "degrees": [
//       "76",
//       "48",
//       "26",
//       "64",
//       "41",
//       "56",
//       "38"
//     ],
//     "total_grade": "",
//     "total": 273,
//     "rank": 377,
//     "total_percentage": "45.50"
//   },
//   {
//     "name": "فاتن سيد ثابت محمد على",
//     "id": 20558,
//     "degrees": [
//       "58",
//       "48",
//       "51",
//       "57",
//       "33",
//       "56",
//       "28"
//     ],
//     "total_grade": "",
//     "total": 273,
//     "rank": 378,
//     "total_percentage": "45.50"
//   },
//   {
//     "name": "مريم وائل مختار محمدعبدالمجيد",
//     "id": 25234,
//     "degrees": [
//       "60",
//       "37",
//       "48",
//       "51",
//       "35",
//       "58",
//       "42"
//     ],
//     "total_grade": "",
//     "total": 271,
//     "rank": 379,
//     "total_percentage": "45.17"
//   },
//   {
//     "name": "أسماء على إبراهيم على نصر الدين",
//     "id": 25562,
//     "degrees": [
//       "58",
//       "52",
//       "45",
//       "51",
//       "51",
//       "49",
//       "21"
//     ],
//     "total_grade": "",
//     "total": 269,
//     "rank": 380,
//     "total_percentage": "44.83"
//   },
//   {
//     "name": "رحمة خالد محمود عبدالنعيم آدم",
//     "id": 25216,
//     "degrees": [
//       "66",
//       "38",
//       "53",
//       "69",
//       "23",
//       "52",
//       "31"
//     ],
//     "total_grade": "",
//     "total": 266,
//     "rank": 381,
//     "total_percentage": "44.33"
//   },
//   {
//     "name": "بسملة أحمد صابر رزق فضل الله",
//     "id": 25212,
//     "degrees": [
//       "58",
//       "49",
//       "39",
//       "71",
//       "33",
//       "42",
//       "31"
//     ],
//     "total_grade": "",
//     "total": 265,
//     "rank": 382,
//     "total_percentage": "44.17"
//   },
//   {
//     "name": "عبدالله إبراهيم الدسوقى فكرى",
//     "id": 25455,
//     "degrees": [
//       "80",
//       "29",
//       "43",
//       "47",
//       "63",
//       "61",
//       "22"
//     ],
//     "total_grade": "",
//     "total": 265,
//     "rank": 383,
//     "total_percentage": "44.17"
//   },
//   {
//     "name": "نضال محمد حسين موسي",
//     "id": 20171,
//     "degrees": [
//       "82",
//       "49",
//       "32",
//       "59",
//       "48",
//       "43",
//       "33"
//     ],
//     "total_grade": "",
//     "total": 264,
//     "rank": 384,
//     "total_percentage": "44.00"
//   },
//   {
//     "name": "زياد محمود عوض عبدالرحمن",
//     "id": 25453,
//     "degrees": [
//       "66",
//       "31",
//       "48",
//       "/64",
//       "42",
//       "50",
//       "29"
//     ],
//     "total_grade": "",
//     "total": 264,
//     "rank": 385,
//     "total_percentage": "44.00"
//   },
//   {
//     "name": "خالد أشرف محمد محمد المغربى",
//     "id": 25028,
//     "degrees": [
//       "88",
//       "62",
//       "غـ",
//       "67",
//       "66",
//       "40",
//       "28"
//     ],
//     "total_grade": "",
//     "total": 263,
//     "rank": 386,
//     "total_percentage": "43.83"
//   },
//   {
//     "name": "شروق محمد عبدالمحسن دياب",
//     "id": 25221,
//     "degrees": [
//       "70",
//       "20",
//       "52",
//       "49",
//       "50",
//       "49",
//       "43"
//     ],
//     "total_grade": "",
//     "total": 263,
//     "rank": 387,
//     "total_percentage": "43.83"
//   },
//   {
//     "name": "فيصل حسين فيصل خلف الله",
//     "id": 25458,
//     "degrees": [
//       "58",
//       "36",
//       "24",
//       "43",
//       "51",
//       "56",
//       "51"
//     ],
//     "total_grade": "",
//     "total": 261,
//     "rank": 388,
//     "total_percentage": "43.50"
//   },
//   {
//     "name": "يوسف هشام محمد سيد",
//     "id": 25575,
//     "degrees": [
//       "52",
//       "27",
//       "53",
//       "65",
//       "52",
//       "50",
//       "14"
//     ],
//     "total_grade": "",
//     "total": 261,
//     "rank": 389,
//     "total_percentage": "43.50"
//   },
//   {
//     "name": "بسملة معوض سمير محمد",
//     "id": 25019,
//     "degrees": [
//       "70",
//       "34",
//       "56",
//       "68",
//       "44",
//       "46",
//       "12"
//     ],
//     "total_grade": "",
//     "total": 260,
//     "rank": 390,
//     "total_percentage": "43.33"
//   },
//   {
//     "name": "نورهان محمد فتحى السيد",
//     "id": 25461,
//     "degrees": [
//       "60",
//       "38",
//       "53",
//       "38",
//       "40",
//       "56",
//       "35"
//     ],
//     "total_grade": "",
//     "total": 260,
//     "rank": 391,
//     "total_percentage": "43.33"
//   },
//   {
//     "name": "هنا مصطفى سالمان حسين",
//     "id": 25245,
//     "degrees": [
//       "66",
//       "27",
//       "65",
//       "39",
//       "45",
//       "50",
//       "33"
//     ],
//     "total_grade": "",
//     "total": 259,
//     "rank": 392,
//     "total_percentage": "43.17"
//   },
//   {
//     "name": "ندى وحيد عبدالباسط عواد الدريعي",
//     "id": 25242,
//     "degrees": [
//       "66",
//       "44",
//       "33",
//       "56",
//       "33",
//       "53",
//       "37"
//     ],
//     "total_grade": "",
//     "total": 256,
//     "rank": 393,
//     "total_percentage": "42.67"
//   },
//   {
//     "name": "محمد محمد فهمي إسماعيل",
//     "id": 25068,
//     "degrees": [
//       "52",
//       "31",
//       "44",
//       "64",
//       "28",
//       "42",
//       "41"
//     ],
//     "total_grade": "",
//     "total": 250,
//     "rank": 394,
//     "total_percentage": "41.67"
//   },
//   {
//     "name": "ياسمين سويلم كمال سالم",
//     "id": 25246,
//     "degrees": [
//       "62",
//       "26",
//       "42",
//       "52",
//       "36",
//       "63",
//       "30"
//     ],
//     "total_grade": "",
//     "total": 249,
//     "rank": 395,
//     "total_percentage": "41.50"
//   },
//   {
//     "name": "عصام علاءالدين طه محمد الشافعى",
//     "id": 25224,
//     "degrees": [
//       "68",
//       "31",
//       "42",
//       "54",
//       "37",
//       "37",
//       "45"
//     ],
//     "total_grade": "",
//     "total": 246,
//     "rank": 396,
//     "total_percentage": "41.00"
//   },
//   {
//     "name": "مريم أحمد محمد صديق",
//     "id": 20314,
//     "degrees": [
//       "68",
//       "28",
//       "28",
//       "70",
//       "29",
//       "43",
//       "45"
//     ],
//     "total_grade": "",
//     "total": 243,
//     "rank": 397,
//     "total_percentage": "40.50"
//   },
//   {
//     "name": "محمد محمود محمد محمود",
//     "id": 25231,
//     "degrees": [
//       "52",
//       "27",
//       "34",
//       "56",
//       "42",
//       "35",
//       "49"
//     ],
//     "total_grade": "",
//     "total": 243,
//     "rank": 398,
//     "total_percentage": "40.50"
//   },
//   {
//     "name": "محمد على عبداللطيف على",
//     "id": 25230,
//     "degrees": [
//       "62",
//       "32",
//       "40",
//       "60",
//       "31",
//       "40",
//       "38"
//     ],
//     "total_grade": "",
//     "total": 241,
//     "rank": 399,
//     "total_percentage": "40.17"
//   },
//   {
//     "name": "شهد رمضان عبدالحميد أحمد",
//     "id": 25222,
//     "degrees": [
//       "52",
//       "24",
//       "39",
//       "51",
//       "28",
//       "55",
//       "42"
//     ],
//     "total_grade": "",
//     "total": 239,
//     "rank": 400,
//     "total_percentage": "39.83"
//   },
//   {
//     "name": "منةالله هانى رجب ابو شوشة",
//     "id": 25238,
//     "degrees": [
//       "66",
//       "26",
//       "47",
//       "52",
//       "36",
//       "52",
//       "24"
//     ],
//     "total_grade": "",
//     "total": 237,
//     "rank": 401,
//     "total_percentage": "39.50"
//   },
//   {
//     "name": "سارة رضوان محمود سيد",
//     "id": 20077,
//     "degrees": [
//       "72",
//       "28",
//       "50",
//       "36",
//       "37",
//       "46",
//       "36"
//     ],
//     "total_grade": "",
//     "total": 233,
//     "rank": 402,
//     "total_percentage": "38.83"
//   },
//   {
//     "name": "محمود حسن فرحات محمد",
//     "id": 25232,
//     "degrees": [
//       "68",
//       "39",
//       "21",
//       "36",
//       "40",
//       "48",
//       "47"
//     ],
//     "total_grade": "",
//     "total": 231,
//     "rank": 403,
//     "total_percentage": "38.50"
//   },
//   {
//     "name": "أحمد جمال سيد عباس",
//     "id": 25561,
//     "degrees": [
//       "68",
//       "50",
//       "21",
//       "55",
//       "غـ",
//       "48",
//       "50"
//     ],
//     "total_grade": "",
//     "total": 224,
//     "rank": 404,
//     "total_percentage": "37.33"
//   },
//   {
//     "name": "عائشة فارس محمد عبدالحليم بيومى",
//     "id": 25564,
//     "degrees": [
//       "64",
//       "28",
//       "21",
//       "16",
//       "60",
//       "44",
//       "43"
//     ],
//     "total_grade": "",
//     "total": 212,
//     "rank": 405,
//     "total_percentage": "35.33"
//   },
//   {
//     "name": "محمد أشرف عبدالغنى محمد شلبى",
//     "id": 25566,
//     "degrees": [
//       "62",
//       "26",
//       "33",
//       "41",
//       "39",
//       "36",
//       "37"
//     ],
//     "total_grade": "",
//     "total": 212,
//     "rank": 406,
//     "total_percentage": "35.33"
//   },
//   {
//     "name": "محمد حسام محمد محمد الحصاوى",
//     "id": 25227,
//     "degrees": [
//       "50",
//       "29",
//       "32",
//       "50",
//       "28",
//       "36",
//       "36"
//     ],
//     "total_grade": "",
//     "total": 211,
//     "rank": 407,
//     "total_percentage": "35.17"
//   },
//   {
//     "name": "عبداللطيف هادى إبراهيم حسن حسين الأبرش",
//     "id": 20304,
//     "degrees": [
//       "66",
//       "41",
//       "36",
//       "48",
//       "23",
//       "39",
//       "21"
//     ],
//     "total_grade": "",
//     "total": 208,
//     "rank": 408,
//     "total_percentage": "34.67"
//   },
//   {
//     "name": "عادل عبدالمرضي عبده عبدالعزيز",
//     "id": 25223,
//     "degrees": [
//       "64",
//       "35",
//       "30",
//       "25",
//       "32",
//       "45",
//       "41"
//     ],
//     "total_grade": "",
//     "total": 208,
//     "rank": 409,
//     "total_percentage": "34.67"
//   },
//   {
//     "name": "شروق محمود عزالدين نورالدين",
//     "id": 20087,
//     "degrees": [
//       "62",
//       "23",
//       "45",
//       "39",
//       "17",
//       "45",
//       "24"
//     ],
//     "total_grade": "",
//     "total": 193,
//     "rank": 410,
//     "total_percentage": "32.17"
//   },
//   {
//     "name": "عمر رضا أبوسريع عبدالغفار",
//     "id": 20307,
//     "degrees": [
//       "68",
//       "18",
//       "28",
//       "20",
//       "20",
//       "57",
//       "50"
//     ],
//     "total_grade": "",
//     "total": 193,
//     "rank": 411,
//     "total_percentage": "32.17"
//   },
//   {
//     "name": "منةالله وائل عابدين بكر",
//     "id": 25239,
//     "degrees": [
//       "40",
//       "8",
//       "36",
//       "34",
//       "34",
//       "43",
//       "30"
//     ],
//     "total_grade": "",
//     "total": 185,
//     "rank": 412,
//     "total_percentage": "30.83"
//   },
//   {
//     "name": "أحمد نبهان",
//     "id": 20292,
//     "degrees": [
//       "غـ",
//       "26",
//       "24",
//       "33",
//       "28",
//       "52",
//       "21"
//     ],
//     "total_grade": "",
//     "total": 184,
//     "rank": 413,
//     "total_percentage": "30.67"
//   },
//   {
//     "name": "مريم كمال الدين صابر محمود",
//     "id": 25074,
//     "degrees": [
//       "50",
//       "20",
//       "35",
//       "44",
//       "26",
//       "42",
//       "14"
//     ],
//     "total_grade": "",
//     "total": 181,
//     "rank": 414,
//     "total_percentage": "30.17"
//   },
//   {
//     "name": "يوسف محمد على دياب عبدالتواب",
//     "id": 25574,
//     "degrees": [
//       "60",
//       "غـ",
//       "غـ",
//       "غـ",
//       "62",
//       "55",
//       "غـ"
//     ],
//     "total_grade": "",
//     "total": 117,
//     "rank": 415,
//     "total_percentage": "19.50"
//   },
//   {
//     "name": "وائل حمدي عبدالوهاب أحمد",
//     "id": 25571,
//     "degrees": [
//       "68",
//       "15",
//       "24",
//       "20",
//       "15",
//       "20",
//       "12"
//     ],
//     "total_grade": "",
//     "total": 106,
//     "rank": 416,
//     "total_percentage": "17.67"
//   },
//   {
//     "name": "يوسف سعيد سالم مرسى أحمد",
//     "id": 25573,
//     "degrees": [
//       "52",
//       "غـ",
//       "51",
//       "غـ",
//       "54",
//       "غـ",
//       "غـ"
//     ],
//     "total_grade": "",
//     "total": 105,
//     "rank": 417,
//     "total_percentage": "17.50"
//   },
//   {
//     "name": "نورهان شعبان فرج الله أحمد",
//     "id": 25090,
//     "degrees": [
//       "غـ",
//       "غـ",
//       "غـ",
//       "84",
//       "غـ",
//       "غـ",
//       "غـ"
//     ],
//     "total_grade": "",
//     "total": 84,
//     "rank": 418,
//     "total_percentage": "14.00"
//   },
//   {
//     "name": "عمر عادل عبدالرؤف على السيد",
//     "id": 20308,
//     "degrees": [
//       "56",
//       "غـ",
//       "غـ",
//       "66",
//       "غـ",
//       "غـ",
//       "غـ"
//     ],
//     "total_grade": "",
//     "total": 66,
//     "rank": 419,
//     "total_percentage": "11.00"
//   },
//   {
//     "name": "ياسمين أشرف رمضان عرفة",
//     "id": 25572,
//     "degrees": [
//       "74",
//       "غـ",
//       "64",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ"
//     ],
//     "total_grade": "",
//     "total": 64,
//     "rank": 420,
//     "total_percentage": "10.67"
//   },
//   {
//     "name": "راندا وفقى عبدالله أبوالمجد",
//     "id": 20670,
//     "degrees": [
//       "60",
//       "غـ",
//       "غـ",
//       "غـ",
//       "50",
//       "غـ",
//       "غـ"
//     ],
//     "total_grade": "",
//     "total": 50,
//     "rank": 421,
//     "total_percentage": "8.33"
//   },
//   {
//     "name": "إسلام شعبان عبدالهادي رزق محمد",
//     "id": 25207,
//     "degrees": [
//       "غـ",
//       "غـ",
//       "غـ",
//       "39",
//       "غـ",
//       "غـ",
//       "غـ"
//     ],
//     "total_grade": "",
//     "total": 39,
//     "rank": 422,
//     "total_percentage": "6.50"
//   },
//   {
//     "name": "أحمد فرج جوده ضيف",
//     "id": 20014,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 423,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "الخير بابكر عبدالرحمن الحضيرى",
//     "id": 20024,
//     "degrees": [
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ"
//     ],
//     "total_grade": "",
//     "total": 0,
//     "rank": 424,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "تشانغ يى تشوان",
//     "id": 20039,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 425,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "طلحه زياد العيان",
//     "id": 20096,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 426,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "فايز جاعد مشعان صاهود",
//     "id": 20117,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 427,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "ليو نيغ",
//     "id": 20125,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 428,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "ما سويغ",
//     "id": 20126,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 429,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "نايف معتز شعيفان قديفان الرشيدى",
//     "id": 20166,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 430,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "أحمد سلامة ضحوي حمد",
//     "id": 20291,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 431,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "أضوء عيد مشخص سند مبارك البذالى",
//     "id": 20293,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 432,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "حسن عايض حسن محمد ثقل",
//     "id": 20294,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 433,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "خالد عزبه العذاب",
//     "id": 20295,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 434,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "سعد فيصل سالم فهد سعد الهاجرى",
//     "id": 20297,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 435,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "سعدون سليمان سلامة مليح محارب الجميلى",
//     "id": 20298,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 436,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "سوز يى",
//     "id": 20300,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 437,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "عبدالرحمن حميد سعود عريبى دليم السليمانى",
//     "id": 20301,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 438,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "عبدالرحمن عبدالله أحمد حسن الأنصارى",
//     "id": 20302,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 439,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "عبدالرحمن فلاح عبدالعزيز عايض العشيبان العازمى",
//     "id": 20303,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 440,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "عثمان سالم مطلق جابر جاسم الضفيرى",
//     "id": 20306,
//     "degrees": [
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ"
//     ],
//     "total_grade": "",
//     "total": 0,
//     "rank": 441,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "لا بينجى",
//     "id": 20309,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 442,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "ما رويى",
//     "id": 20310,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 443,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "ما ون شيو",
//     "id": 20311,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 444,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "مبارك فلاح مبارك فالح ردنان الصلبى",
//     "id": 20312,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 445,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "محمد عبدالله فهد منصور حتيته المطيرى",
//     "id": 20313,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 446,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "ناصر راشد ناصر بداح حطيم العجمى",
//     "id": 20317,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 447,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "جمانة مبارك عجرم دغيمان الصليلى",
//     "id": 20554,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 448,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "خضرة شيخ عبدالرحمن نور",
//     "id": 20555,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 449,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "مالك محمد عبدالله سعود عجلان الدوسرى",
//     "id": 20559,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 450,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "محمد حيدرا",
//     "id": 20560,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 451,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "محمد سعود عناد مهنا خلف الخالدى",
//     "id": 20562,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 452,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "وليد خالد محمد غازى عبدالعالى المطيرى",
//     "id": 20564,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 453,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "أمثال محمد محارب بانى عويضان العنزى",
//     "id": 20665,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 454,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "خالد فيصل محمد صغير مسهوج العنزى",
//     "id": 20667,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 455,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "دلال ضحوى هويدى الحربى",
//     "id": 20668,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 456,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "سعد على شايع منزل حطاب المطيرى",
//     "id": 20671,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 457,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "ماضى محمد ماضى سالم حماد العجمى",
//     "id": 20676,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 458,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "متعب عابد الخوى الحريجى",
//     "id": 20677,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 459,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "محمد على عوض خضيرى العنزى",
//     "id": 20678,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 460,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "هدى بسيوني رياض نوح أبوالجريد",
//     "id": 25095,
//     "degrees": [
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ"
//     ],
//     "total_grade": "",
//     "total": 0,
//     "rank": 461,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "أيمن مصطفى شاكر مبروك",
//     "id": 25210,
//     "degrees": [
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ"
//     ],
//     "total_grade": "",
//     "total": 0,
//     "rank": 462,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "عبدالله محمد محمود أبوالعزم",
//     "id": 25565,
//     "degrees": [
//       "50",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ",
//       "غـ"
//     ],
//     "total_grade": "",
//     "total": 0,
//     "rank": 463,
//     "total_percentage": "0.00"
//   },
//   {
//     "name": "هبة الصادق عزالدين الطاهر",
//     "id": 25570,
//     "degrees": [
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب",
//       "حجب"
//     ],
//     "total_grade": "حجب",
//     "total": 0,
//     "rank": 464,
//     "total_percentage": "0.00"
//   }
// ]

// data.forEach(async student => {
//   await setDoc(doc(firebaseDB, "grade_2/degrees/2024_25", `${student.id}`), student);

// })